[{"title": "Dinner with Katy Perry", "body": "We ate Foo at Bar with Moe and Larry. Their Acme bread was great!", "zip": "10004", "latitude": 40.705076, "longitude": -74.00916, "halflife": 100, "visitedBy": [2, 3, 5, 9, 100, 60]}, {"title": "My JWT video on sale", "body": "And I have 2000 other videos on youtube. Also I write 500 tech blogs per day. And I do pull request at least 100 times a day. And no, I don't sleep.", "zip": "11040", "latitude": 40.7326609, "longitude": -73.6948277, "halflife": 100, "visitedBy": [1, 9, 21, 30, 38, 90]}, {"title": "I have advice for you", "body": "One - During an interview, don't freak out. Two - Keep your resume in one page. Three - Ask questions. Four - dress appropriately. [ ... post truncated because too long ... ] OK that's it. I'm done. I'll stop talking.", "zip": "07424", "latitude": 40.9151955, "longitude": -74.2028202, "halflife": 100, "visitedBy": [7, 8, 89, 47, 99, 24, 70]}, {"title": "Free Pizza \\(^o^)/", "body": "I just got a job that pays $400k! I'm buying everyone pizza!", "zip": "07052", "latitude": 40.7920341, "longitude": -74.2980747, "halflife": 100, "visitedBy": [47, 8, 9, 6, 47, 199, 24, 70]}, {"title": "In seed time learn, in harvest teach, in winter enjoy.", "body": "It's to look for problems, preferably problems you have yourself.The very best startup ideas tend to have three things in common: they're something the founders themselves want, that they themselves can build, and that few others realize are worth doing.", "latitude": "37.86726", "longitude": "-121.76801", "userId": 38, "storylineId": 99, "halflife": 51}, {"title": "Turn your face toward the sun and the shadows will fall behind you.", "body": "Won't we just tell computers what we want them to do?There hasn't been a lot of progress in that department so far.", "latitude": "29.82036", "longitude": "3.84861", "userId": 26, "storylineId": 5, "halflife": 83}, {"title": "Those who will play with cats must expect to be scratched.", "body": "It seems to  me the business guys who did the most for Google were the ones who  obligingly flew Altavista into a hillside just as Google was getting started.The hard part about figuring out what customers want is figuring  out that you need to figure it out.", "latitude": "47.72674", "longitude": "11.96083", "userId": 315, "storylineId": 98, "halflife": 87}, {"title": "Reality does not conform to the ideal, but confirms it.", "body": "Despite their name, the super-angels are really mini VC funds, and they clearly have existing VCs in their sights.They would seem to have history on their side.", "latitude": "18.5616", "longitude": "12.0484", "userId": 341, "storylineId": 51, "halflife": 87}, {"title": "Well begun is half done.", "body": "But you can't dictate the problem to fit your solution.Historically, scarce-resource arguments have been the losing side in debates about software design.", "latitude": "44.83125", "longitude": "140.21047", "userId": 235, "storylineId": 80, "halflife": 47}, {"title": "Quality means doing it right when no one is looking.", "body": "Because of Y Combinator's position at the very start of the venture funding process, we're probably the world's leading experts on the psychology of people who aren't sure if they want to start a company.There's nothing wrong with being unsure.", "latitude": "42.38763", "longitude": "2.01462", "userId": 202, "storylineId": 89, "halflife": 63}, {"title": "A man is not where he lives but where he loves.", "body": "You'll probably have to find the city where you feel at home to know what sort of ambition you have.Notes[1]", "latitude": "43.62904", "longitude": "-86.95692", "userId": 192, "storylineId": 94, "halflife": 14}, {"title": "To be wronged is nothing unless you continue to remember it.", "body": "The ordering system and image generator were written in C and C++, the manager mostly in Perl, and the editor in Lisp.[8]", "latitude": "28.15278", "longitude": "-88.944", "userId": 102, "storylineId": 85, "halflife": 31}, {"title": "No is easier to do. Yes is easier to say.", "body": "It was only then that we realized that they were effectively QA and to some extent marketing as well.", "latitude": "18.43997", "longitude": "-76.22944", "userId": 38, "storylineId": 13, "halflife": 32}, {"title": "Trust yourself. You know more than you think you do.", "body": "It's not so much that resembling nature is intrinsically good as that nature has had a long time to work on the problem.", "latitude": "34.25833", "longitude": "9.56485", "userId": 245, "storylineId": 75, "halflife": 16}, {"title": "Set your goals high, and don't stop till you get there.", "body": "Maybe there would be practical limits on the number of startups any one acquirer could assimilate, but if there is value to be had, in the form of upside that founders are willing to forgo in return for an immediate payment, acquirers will evolve to consume it.", "latitude": "48.55534", "longitude": "-0.91882", "userId": 482, "storylineId": 24, "halflife": 72}, {"title": "He who obtains has little. He who scatters has much.", "body": "But when Bill Clerico starts calling you, you may as well do what he asks, because he is not going away.", "latitude": "40.65846", "longitude": "8.91864", "userId": 10, "storylineId": 79, "halflife": 35}, {"title": "I believe that every person is born with talent.", "body": "They'd rather lose the deal than establish a precedent of VCs competitively bidding against one another.", "latitude": "47.52772", "longitude": "5.4376", "userId": 191, "storylineId": 32, "halflife": 52}, {"title": "Stay away from what might have been and look at what will be.", "body": "In fact, our ideas about what's possible tend to be so limited by whatever language we think in  that easier formulations of programs seem very surprising.", "latitude": "60.12381", "longitude": "73.52907", "userId": 276, "storylineId": 41, "halflife": 83}, {"title": "Your attitude, not your aptitude, will determine your altitude.", "body": "You would not believe the amount of money companies spend on software, and the crap they get in return.", "latitude": "56.70389", "longitude": "-1.00837", "userId": 403, "storylineId": 95, "halflife": 44}, {"title": "He who conquers others is strong; He who conquers himself is mighty.", "body": "When I first read this in my early twenties, it was a big surprise to me and seemed to have huge implications.", "latitude": "8.15889", "longitude": "86.38278", "userId": 480, "storylineId": 96, "halflife": 90}, {"title": "He who knows, does not speak. He who speaks, does not know.", "body": "It's a fine idea in principle to finance your startup with its own revenues, but you can't create instant customers.", "latitude": "39.44615", "longitude": "-5.4", "userId": 62, "storylineId": 99, "halflife": 23}, {"title": "I hear and I forget. I see and I remember. I do and I understand.", "body": "Y Combinator we measure growth rate per week, partly because there is so little time before Demo Day, and partly because startups early on need frequent feedback from their users to tweak what they're doing.", "latitude": "12.13433", "longitude": "-105.35402", "userId": 430, "storylineId": 66, "halflife": 57}, {"title": "Change your words. Change your world.", "body": "It's a rare startup that doesn't build something the founders use.The main reason there are so many iPhone apps is that so many programmers have iPhones.", "latitude": "6.37389", "longitude": "24.43853", "userId": 368, "storylineId": 86, "halflife": 26}, {"title": "If you have knowledge, let others light their candles in it.", "body": "But as long as your critical spirit doesn't outweigh your hope, you'll be able to look at your admittedly incomplete system, and think, how hard can it be to get the rest of the way?, thereby continuing the cycle.It's tricky to keep the two forces balanced.", "latitude": "30.86137", "longitude": "11.7953", "userId": 186, "storylineId": 42, "halflife": 90}, {"title": "Kind words do not cost much. Yet they accomplish much.", "body": "When you're young, especially, you often find yourself working on stuff you don't really like-- because it seems impressive, for example, or because you've been assigned to work on it.", "latitude": "-32.90605", "longitude": "8.40146", "userId": 399, "storylineId": 9, "halflife": 41}, {"title": "A man who doesn't trust himself can never really trust anyone else.", "body": "So while it may seem surprising to propose that large numbers of people will change the way they make a living, it would be more surprising if they didn't.2.", "latitude": "-35.03285", "longitude": "-0.28913", "userId": 200, "storylineId": 33, "halflife": 29}, {"title": "A prudent question is one half of wisdom.", "body": "The reason Amazon did it first was not that they were especially smart, but because they were one of the earliest sites with enough clout to force customers to log in before they could buy something.", "latitude": "31.5977", "longitude": "-2.86489", "userId": 145, "storylineId": 14, "halflife": 87}, {"title": "To fly, we have to have resistance.", "body": "[3]We've now funded so many different types of founders that we have enough data to see patterns, and there seems to be no benefit from working for a big company.", "latitude": "39.1001", "longitude": "138.43333", "userId": 92, "storylineId": 90, "halflife": 6}, {"title": "The path to success is to take massive, determined action.", "body": "The main function of your initial version is to   be rewritten.That's why we advise groups to ignore issues like scalability, internationalization, and heavy-duty security at first.", "latitude": "56.48988", "longitude": "-86.95692", "userId": 205, "storylineId": 67, "halflife": 20}, {"title": "Time is the wisest counsellor of all.", "body": "It's a lot easier for a couple of hackers to figure out how to rent office space or hire sales people than it is for a company of any size to get software written.", "latitude": "41.5125", "longitude": "-99.61792", "userId": 218, "storylineId": 63, "halflife": 30}, {"title": "Peace begins with a smile.", "body": "If you work hard at being a bond trader for ten years, thinking that you'll quit and write novels when you have enough money, what happens when you quit and then discover that you don't actually like writing novels?Most", "latitude": "29.94968", "longitude": "82.13836", "userId": 471, "storylineId": 32, "halflife": 28}, {"title": "Be kind whenever possible. It is always possible.", "body": "But I will give you a couple reasons why a safe career might not be what your parents really want for you.One is that parents tend to be more conservative for their kids than they would be for themselves.", "latitude": "19.80083", "longitude": "-97.52674", "userId": 31, "storylineId": 51, "halflife": 83}, {"title": "Someone is special only if you tell them.", "body": "Python has a form of 7, though there doesn't seem to be     any syntax for it.As for number 8, this may be the most interesting of the lot.", "latitude": "38.21607", "longitude": "17.08578", "userId": 216, "storylineId": 86, "halflife": 71}, {"title": "Spring is a time for rebirth and the fulfilment of new life.", "body": "We think of the techniques we're developing for dealing with large numbers of startups as like software.", "latitude": "44.90506", "longitude": "10.34764", "userId": 213, "storylineId": 47, "halflife": 76}, {"title": "A short saying oft contains much wisdom.", "body": "There's no reason a new Lisp shouldn't have string libraries as good as Perl, and if this new Lisp also had powerful libraries for server-based applications, it could be very popular.", "latitude": "6.70083", "longitude": "-99.61792", "userId": 355, "storylineId": 39, "halflife": 39}, {"title": "Do good by stealth, and blush to find it fame.", "body": "All you need is strong convictions.Do religion and politics have something in common that explains this similarity?", "latitude": "25.25857", "longitude": "9.01223", "userId": 443, "storylineId": 17, "halflife": 29}, {"title": "Bite off more than you can chew, then chew it.", "body": "They're helpful in doing deals and arranging introductions, and some of the smarter ones, particularly angels, can give good advice about the product.In fact, I'd say what separates the great investors from the mediocre ones is the quality of their advice.", "latitude": "52.99826", "longitude": "-35.62654", "userId": 410, "storylineId": 87, "halflife": 75}, {"title": "Wherever a man turns he can find someone who needs him.", "body": "For a lot of founders that was the big surprise:      How hard it is to keep everyone motivated during rough days or     weeks, i.e.", "latitude": "38.97372", "longitude": "79.87533", "userId": 372, "storylineId": 29, "halflife": 73}, {"title": "It is not in the stars to hold our destiny but in ourselves.", "body": "It brought a critical mass of experts in an important new technology together in a place they liked enough to stay.CompetingOf course, a would-be silicon valley faces an obstacle the original one didn't: it has to compete with Silicon Valley.", "latitude": "44.90711", "longitude": "121.30918", "userId": 265, "storylineId": 30, "halflife": 20}, {"title": "Real magic in relationships means an absence of judgement of others.", "body": "Someone ignorant but smart will come along and reinvent everything, and in the process simply fail to reproduce certain existing ideas.MinusSo much for the advantages of young founders.", "latitude": "26.31941", "longitude": "12.11667", "userId": 229, "storylineId": 23, "halflife": 76}, {"title": "There are no failures \u0097 just experiences and your reactions to them.", "body": "And because startup founders work under great    pressure, it's critical they be friends.I didn't realize it till I was writing this, but that may help explain why there are so few female startup founders.", "latitude": "46.72147", "longitude": "-4.21583", "userId": 482, "storylineId": 100, "halflife": 68}, {"title": "Nature takes away any faculty that is not used.", "body": "And when my friend Trevor showed up at my house recently, he was carrying a Powerbook identical to mine.For most of us, it's not a switch to Apple, but a return.", "latitude": "35.616", "longitude": "-0.16042", "userId": 24, "storylineId": 34, "halflife": 13}, {"title": "You cannot be lonely if you like the person you're alone with.", "body": "There is a lot more to discover.Notes [1] In practice formal logic is not much use, because despite some progress in the last 150 years we're still only able to formalize a small percentage of statements.", "latitude": "14.16667", "longitude": "-74.60766", "userId": 255, "storylineId": 51, "halflife": 84}, {"title": "Intuition will tell the thinking mind where to look next.", "body": "At Viaweb (now Yahoo Store), we raised some eyebrows among VCs and potential acquirers by using Lisp.", "latitude": "29.82036", "longitude": "-98.36817", "userId": 199, "storylineId": 33, "halflife": 88}, {"title": "Ideas are the beginning points of all fortunes.", "body": "At the top schools, I'd guess as many as a quarter of the CS majors could make it as startup founders if they wanted.That \"if they wanted\" is an important qualification?so important that it's almost cheating to append it like that?because once you get over a certain threshold of intelligence, which most CS majors at top schools are past, the deciding factor in whether you succeed as a founder is how much you want to.", "latitude": "42.31639", "longitude": "16.86049", "userId": 203, "storylineId": 65, "halflife": 66}, {"title": "A jug fills drop by drop.", "body": "Be independent.A startup with a couple founders in their early twenties can have expenses so low that they could be profitable on as little as $2000 per month.", "latitude": "52.08351", "longitude": "106.65798", "userId": 270, "storylineId": 15, "halflife": 11}, {"title": "If one does not know to which port is sailing, no wind is favorable.", "body": "Whereas the independence of the townsmen allowed them to keep whatever wealth they created.Once it became possible to get rich by creating wealth, society as a whole started to get richer very rapidly.", "latitude": "36.40784", "longitude": "-92.24605", "userId": 193, "storylineId": 74, "halflife": 39}, {"title": "Most folks are about as happy as they make up their minds to be.", "body": "And to reproduce that you need those people.UniversitiesThe exciting thing is, all you need are the people.", "latitude": "53.92385", "longitude": "-74.01042", "userId": 357, "storylineId": 16, "halflife": 32}, {"title": "I always wanted to be somebody, but I should have been more specific.", "body": "They've lost most of their momentum.Investors have no idea how much they damage the companies they invest in by taking so long to do it.", "latitude": "44.82295", "longitude": "8.76667", "userId": 215, "storylineId": 20, "halflife": 48}, {"title": "A man who doesn't trust himself can never really trust anyone else.", "body": "It might not be your dream job, but you're not going to starve.Another advantage of bad times is that there's less competition.", "latitude": "47.2", "longitude": "-165.40639", "userId": 6, "storylineId": 34, "halflife": 40}, {"title": "Our intention creates our reality.", "body": "I'd much rather read an essay that went off in an unexpected but interesting direction than one that plodded dutifully along a prescribed course.So what's interesting?", "latitude": "19.11709", "longitude": "112.18987", "userId": 438, "storylineId": 19, "halflife": 83}, {"title": "Your big opportunity may be right where you are now.", "body": "Kant.[13] Wittgenstein asserted a sort of mastery to which the inhabitants of early 20th century Cambridge seem to have been peculiarly vulnerable?perhaps partly because so many had been raised religious and then stopped believing, so had a vacant space in their heads for someone to tell them what to do (others chose Marx or Cardinal Newman), and partly because a quiet, earnest place like Cambridge in that era had no natural immunity to messianic figures, just as European politics then had no na", "latitude": "50.87602", "longitude": "-73.41707", "userId": 122, "storylineId": 25, "halflife": 63}, {"title": "Love all, trust a few, do wrong to none.", "body": "Ambitious people are rare, so if everyone is mixed together randomly, as they tend to be early in people's lives, then the ambitious ones won't have many ambitious peers.", "latitude": "39.09193", "longitude": "-75.26129", "userId": 122, "storylineId": 9, "halflife": 12}, {"title": "Imagination is the highest kite one can fly.", "body": "Beneath that the message is much like New York's, though perhaps with more emphasis on physical attractiveness.In", "latitude": "10.7118", "longitude": "107.1014", "userId": 258, "storylineId": 70, "halflife": 42}, {"title": "The bird of paradise alights only upon the hand that does not grasp.", "body": "A few are overfunded, which is like trying to start driving in third gear.I think it would help founders to understand funding better?not just the mechanics of it, but what investors are thinking.", "latitude": "50.36463", "longitude": "12.36667", "userId": 183, "storylineId": 89, "halflife": 28}, {"title": "To be tested is good. The challenged life may be the best therapist.", "body": "And those of us in the technology world know what usually happens when something comes along that can be described in terms like that.", "latitude": "50.75514", "longitude": "6.08497", "userId": 190, "storylineId": 35, "halflife": 17}, {"title": "The secret of success is constancy to purpose.", "body": "Their other interests leave them little attention to spare for popularity, and since popularity resembles a zero-sum game, this in turn makes them targets for the whole school.", "latitude": "18.03264", "longitude": "85.40028", "userId": 319, "storylineId": 8, "halflife": 74}, {"title": "To succeed, we must first believe that we can.", "body": "It would not be far from the truth to say that   education in the classical world meant training landowners' sons to speak well enough to defend their interests in political and legal disputes.[6]", "latitude": "47.06667", "longitude": "11.91965", "userId": 189, "storylineId": 20, "halflife": 19}, {"title": "We must embrace pain and burn it as fuel for our journey.", "body": "Is it just a coincidence that they used the same word, or is    there some overlap in what they meant?", "latitude": "50.06056", "longitude": "10.17421", "userId": 127, "storylineId": 85, "halflife": 12}, {"title": "Silence is the true friend that never betrays.", "body": "The startup will now do that themselves.There will continue to be lead investors in the sense of investors who take the lead in advising a startup.", "latitude": "-6.80694", "longitude": "40.3572", "userId": 41, "storylineId": 86, "halflife": 37}, {"title": "All things change; nothing perishes.", "body": "The people at Google are smart, but no smarter than you; they're not as motivated, because Google is not going to go out of business if this one product fails; and even at Google they have a lot of bureaucracy to slow them down.What you should fear, as a startup, is not the established players, but other startups you don't know exist yet.", "latitude": "44.90711", "longitude": "30.49278", "userId": 39, "storylineId": 71, "halflife": 85}, {"title": "Truth is powerful and it prevails.", "body": "And he'd be right, except that they interfere with the primary function of software in a startup: to   be a vehicle for experimenting with its own design.", "latitude": "44.51494", "longitude": "123.0533", "userId": 20, "storylineId": 36, "halflife": 93}, {"title": "You can do it if you believe you can!", "body": "He completely rewrites the program several times; that wouldn't be justifiable for an official project, but this is a labor of love and he wants it to be perfect.", "latitude": "50.19003", "longitude": "-63.67865", "userId": 77, "storylineId": 57, "halflife": 33}, {"title": "If the shoe doesn't fit, must we change the foot?", "body": "It was common for the master to paint the principal figures and for assistants to paint the others and the background.", "latitude": "-50.0191", "longitude": "6.22553", "userId": 270, "storylineId": 95, "halflife": 81}, {"title": "Nothing great was ever achieved without enthusiasm.", "body": "They're perfectly justified: the majority of hot new whatevers do turn out to be a waste of time, and eventually go away.", "latitude": "-23.20544", "longitude": "-0.18007", "userId": 215, "storylineId": 37, "halflife": 25}, {"title": "The heart has eyes which the brain knows nothing of.", "body": "ItThe second reason we tend to find great disparities of wealth alarming is that for most of human history the usual way to accumulate a fortune was to steal it: in pastoral societies by cattle raiding; in agricultural societies by appropriating others' estates in times of war, and taxing them in times of peace.In conflicts, those on the winning side would receive the estates confiscated from the losers.", "latitude": "44.95782", "longitude": "113.4711", "userId": 221, "storylineId": 80, "halflife": 16}, {"title": "Difficulties are things that show a person what they are.", "body": "Just make sure that you and the startup agree in advance about roughly how much you'll do for them.Really hot companies sometimes have high standards for angels.", "latitude": "45.49742", "longitude": "121.66473", "userId": 358, "storylineId": 57, "halflife": 4}, {"title": "Sometimes by losing a battle you find a new way to win the war.", "body": "The x in Ajax is from the XMLHttpRequest object, which lets the browser communicate with the server in the background while displaying a page.", "latitude": "49.8587", "longitude": "-71.28338", "userId": 275, "storylineId": 56, "halflife": 23}, {"title": "If you want a thing done well, do it yourself.", "body": "As Fred Brooks pointed out in The Mythical Man-Month, adding people to a project tends to slow it down.", "latitude": "41.16117", "longitude": "21.31245", "userId": 82, "storylineId": 70, "halflife": 8}, {"title": "Action will remove the doubts that theory cannot solve.", "body": "I'm pretty sure the answer is yes, because YC is an improved version of what happened to our startup, and our case was not atypical.", "latitude": "50.75514", "longitude": "9.4915", "userId": 470, "storylineId": 16, "halflife": 27}, {"title": "Everyone smiles in the same language.", "body": "One of my main hobbies is the history of technology, and even though I've studied the subject for years, it would take me several weeks of research to be able to say whether patents have in general been a net win.One thing I can say is that 99.9% of the people who express opinions on the subject do it not based on such research, but out of a kind of religious conviction.", "latitude": "49.89773", "longitude": "-72.08222", "userId": 329, "storylineId": 70, "halflife": 54}, {"title": "The world is always in movement.", "body": "VC funding will probably dry up somewhat during the present recession, like it usually does in bad times.", "latitude": "41.07463", "longitude": "139.98779", "userId": 38, "storylineId": 14, "halflife": 13}, {"title": "Self-trust is the first secret of success.", "body": "Though appeal to people is a meaningful test, in practice you can't measure it, just as you can't find north using a compass with a magnet sitting next to it.", "latitude": "41.78502", "longitude": "11.4898", "userId": 241, "storylineId": 83, "halflife": 51}, {"title": "The heart has eyes which the brain knows nothing of.", "body": "(b) Because in medieval towns, monopolies and guild regulations initially slowed the development of new means of production.", "latitude": "41.79393", "longitude": "107.1014", "userId": 111, "storylineId": 90, "halflife": 51}, {"title": "He who obtains has little. He who scatters has much.", "body": "Fred Wilson to: Paul Graham date: Sat, Feb 21, 2009 at 4:26 AM subject: Re: airbnb already spreading to prosThat's true.", "latitude": "7.3025", "longitude": "8.4585", "userId": 310, "storylineId": 19, "halflife": 20}, {"title": "If you light a lamp for somebody, it will also brighten your path.", "body": "[11]  Otherwise these companies would have tried to fix the problem.Training yourself to think unthinkable thoughts has advantages beyond the thoughts themselves.", "latitude": "-20.44222", "longitude": "-82.95823", "userId": 72, "storylineId": 47, "halflife": 97}, {"title": "If only wed stop trying to be happy wed have a pretty good time.", "body": "And yet this startup is obviously going to succeed: their traffic and revenue graphs look like a jet taking off.", "latitude": "54.45417", "longitude": "-4.87228", "userId": 14, "storylineId": 47, "halflife": 93}, {"title": "Never put off till tomorrow what you can do today.", "body": "Swords evolved during the Bronze Age out of daggers, which (like their flint predecessors) had a hilt separate from the blade.", "latitude": "48.86686", "longitude": "119.56904", "userId": 478, "storylineId": 12, "halflife": 27}, {"title": "Life is what happens while you are making other plans.", "body": "1960, John  McCarthy published a remarkable paper in which he did for programming something like what Euclid did for geometry.", "latitude": "39.98316", "longitude": "-122.61026", "userId": 348, "storylineId": 85, "halflife": 40}, {"title": "If there is no struggle, there is no progress.", "body": "If you're having trouble raising money from investors at all, it could save you to be able to shift toward consulting.This works better for some startups than others.", "latitude": "56.39522", "longitude": "-90.07622", "userId": 499, "storylineId": 39, "halflife": 94}, {"title": "The greatest barrier to success is the fear of failure.", "body": "You look at spams and you think, the gall of these guys to try sending me mail  that begins \"Dear Friend\" or has a subject line that's all uppercase and ends in eight exclamation points.", "latitude": "47.63333", "longitude": "1.34428", "userId": 185, "storylineId": 94, "halflife": 58}, {"title": "He who obtains has little. He who scatters has much.", "body": "Several of the fractal buds that have exploded since ancient times involve inventing and discovering new things.", "latitude": "46.15667", "longitude": "8.83333", "userId": 432, "storylineId": 8, "halflife": 81}, {"title": "Friendship isn't a big thing. It's a million little things.", "body": "The most accurate mechanical watch, the Patek Philippe 10 Day Tourbillon, is rated at -1.5 to +2 seconds.", "latitude": "41.93297", "longitude": "11.98694", "userId": 498, "storylineId": 18, "halflife": 25}, {"title": "The more you care, the stronger you can be.", "body": "Stephen Hawking's editor told him that every equation he included in his book would cut sales in half.", "latitude": "46.40346", "longitude": "105.24478", "userId": 111, "storylineId": 79, "halflife": 72}, {"title": "Every new day is another chance to change your life.", "body": "The reason our hypothetical jaded 10 year old bothers me so much is not just that he'd be annoying, but that he'd have cut off his prospects for growth so early.", "latitude": "24.98207", "longitude": "10.63432", "userId": 399, "storylineId": 6, "halflife": 67}, {"title": "To know oneself is to study oneself in action with another person.", "body": "In fact I suspect if you had the sixteen year old Shakespeare or Einstein in school with you, they'd seem impressive, but not totally unlike your other friends.Which is an uncomfortable thought.", "latitude": "22.88427", "longitude": "11.41667", "userId": 131, "storylineId": 43, "halflife": 63}, {"title": "The only real valuable thing is intuition.", "body": "If you invest in a deal led by a big angel like Ron Conway, for example, you're pretty well protected against being mistreated, because any VC would think twice before crossing him.", "latitude": "64.50111", "longitude": "85.40028", "userId": 363, "storylineId": 22, "halflife": 12}, {"title": "Self-complacency is fatal to progress.", "body": "A startup doing something related to entertainment might want to be in New York or LA.And finally, if a good investor has committed to fund you if you stay where you are, you should probably stay.", "latitude": "18.13909", "longitude": "11.85", "userId": 263, "storylineId": 29, "halflife": 72}, {"title": "To be happy is to be able to become aware of oneself without fright.", "body": "When someone's working on a problem that seems too big, I always ask: is there some way to bite off some subset of the problem, then gradually expand from there?", "latitude": "41.42307", "longitude": "-75.58713", "userId": 320, "storylineId": 54, "halflife": 27}, {"title": "In the middle of every difficulty lies opportunity.", "body": "The idea of starting a company with benevolent aims is currently undervalued, because the kind of people who currently make that their explicit goal don't usually do a very good job.It's one of the standard career paths of trustafarians to start some vaguely benevolent business.", "latitude": "16.70462", "longitude": "-95.65081", "userId": 290, "storylineId": 27, "halflife": 42}, {"title": "If you want a thing done well, do it yourself.", "body": "With a tractor an energetic farmer could plow six times as much land in a day as he could with a team of horses.", "latitude": "41.3429", "longitude": "-3.00845", "userId": 435, "storylineId": 10, "halflife": 60}, {"title": "If one does not know to which port is sailing, no wind is favorable.", "body": "I read of one VC who  turned down a startup simply because they'd given away so many little bits of stock that the deal required too many signatures to close.", "latitude": "56.97005", "longitude": "10.32117", "userId": 151, "storylineId": 26, "halflife": 2}, {"title": "Most folks are about as happy as they make up their minds to be.", "body": "Which means to the extent we're correct, those are the qualities you need to win.Investors know this, at least unconsciously.", "latitude": "15.30928", "longitude": "-120.34579", "userId": 24, "storylineId": 25, "halflife": 42}, {"title": "Miracles come in moments. Be ready and willing.", "body": "During the Internet Bubble there  were a number of startups founded by business people who then went looking for hackers to create their product for them.", "latitude": "18.55089", "longitude": "-96.59527", "userId": 216, "storylineId": 82, "halflife": 64}, {"title": "If you want a thing done well, do it yourself.", "body": "We're not hearing about Perl and Python because people are using them to write Windows apps.What this means for us, as people interested in designing programming languages, is that there is now potentially an actual audience for our work.", "latitude": "35.46522", "longitude": "-90.38288", "userId": 330, "storylineId": 75, "halflife": 8}, {"title": "Better to have loved and lost, than to have never loved at all.", "body": "[2] So the lower we can get the response rate-- whether by filtering, or by using filters to force spammers to dilute their pitches-- the fewer businesses will find it worth their while to send spam.The reason the spammers use the kinds of  sales pitches that they do is to increase response rates.", "latitude": "56.7", "longitude": "6.85", "userId": 253, "storylineId": 52, "halflife": 56}, {"title": "The greatest remedy for anger is delay.", "body": "I suspect that working for oneself feels better to humans in much the same way that living in the wild must feel better to a wide-ranging predator like a lion.", "latitude": "50.28407", "longitude": "-74.86667", "userId": 255, "storylineId": 50, "halflife": 37}, {"title": "I begin with an idea and then it becomes something else.", "body": "Remember, the original motivation for HN was to test a new programming language, and moreover one that's focused on experimenting with language design, not performance.", "latitude": "50.05565", "longitude": "-1.95385", "userId": 402, "storylineId": 91, "halflife": 36}, {"title": "The best way out is always through.", "body": "But in every field the lever is getting longer, so the variation we see is something that more and more fields will see as time goes on.", "latitude": "50.32278", "longitude": "10.93333", "userId": 341, "storylineId": 23, "halflife": 51}, {"title": "Shoot for the moon. Even if you miss, you'll land among the stars.", "body": "The word now has such bad connotations that we forget its etymology, though it's staring us in the face.", "latitude": "33.35113", "longitude": "-2.87026", "userId": 458, "storylineId": 46, "halflife": 31}, {"title": "Where there is great love, there are always miracles.", "body": "So despite those millions in the bank, you're still poor.For most startups the model should be grad student, not law firm.", "latitude": "53.26682", "longitude": "-66.79438", "userId": 80, "storylineId": 17, "halflife": 10}, {"title": "Meaning is not what you start with but what you end up with.", "body": "If there's something we can do to decrease the number of axioms in the core language, that would seem to be the side to bet on as t approaches infinity.", "latitude": "15.36694", "longitude": "-43.52833", "userId": 72, "storylineId": 48, "halflife": 37}, {"title": "Nothing diminishes anxiety faster than action.", "body": "And users don't care where you went to college.As well as having precisely measurable results, we have a lot of them.", "latitude": "21.68196", "longitude": "6.18308", "userId": 476, "storylineId": 20, "halflife": 94}, {"title": "Miracles come in moments. Be ready and willing.", "body": "If you want to know whether you're the right sort of person to start a startup, ask yourself whether you're relentlessly resourceful.", "latitude": "55.05286", "longitude": "27.60945", "userId": 260, "storylineId": 84, "halflife": 81}, {"title": "Do what you can. Want what you have. Be who you are.", "body": "When you can ask the opinions of people whose judgement you respect, what does it add to consider the opinions of people you don't even know?", "latitude": "29.66989", "longitude": "119.93172", "userId": 77, "storylineId": 96, "halflife": 93}]