[{"title": "If one does not know to which port is sailing, no wind is favorable.", "body": "Though we're happy to provide this service, this is not generally the way we pitch startup school to potential speakers.[4]", "latitude": "-27.58329", "longitude": "-98.07627", "userId": 426, "storyId": 31, "halflife": 33}, {"title": "Meaning is not what you start with but what you end up with.", "body": "But I'd rather use a site with primitive features and smart, nice users than a more advanced one whose users were idiots or trolls.So the most important thing a community site can do is attract the kind of people it wants.", "latitude": "55.92791", "longitude": "-98.21694", "userId": 108, "storyId": 78, "halflife": 81}, {"title": "Reality is merely an illusion, albeit a very persistent one.", "body": "And since there are some controversial ideas here, I should add that none of them agreed with everything in it.German", "latitude": "42.44454", "longitude": "106.51006", "userId": 280, "storyId": 88, "halflife": 85}, {"title": "The harder you fall, the higher you bounce.", "body": "It's a hub of glamour, a magnet for all the shorter half-life isotopes of style and fame.Nerds don't care about glamour, so to them the appeal of New York is a mystery.", "latitude": "39.40331", "longitude": "124.95278", "userId": 131, "storyId": 78, "halflife": 21}, {"title": "Imagination is the highest kite one can fly.", "body": "He said that in the early days Facebook made a point of hiring programmers even for jobs that would not ordinarily consist of programming, like HR and marketing.So which companies need to have a hacker-centric culture?", "latitude": "45.48803", "longitude": "4.68721", "userId": 109, "storyId": 63, "halflife": 76}, {"title": "Wisdom begins in wonder.", "body": "Robert Morris (aka Rtm) was so publicity averse after the  Worm that he didn't want his name on the site.", "latitude": "-14.2461", "longitude": "-81.30844", "userId": 417, "storyId": 44, "halflife": 9}, {"title": "Be as you wish to seem.", "body": "Unless it's your first priority, it's unlikely to happen at all.HyenasWhen I probe our motives with Artix, I see a third mistake: timidity.", "latitude": "12.62137", "longitude": "-1.77303", "userId": 463, "storyId": 66, "halflife": 22}, {"title": "God always takes the simplest way.", "body": "So you start working.Good and Bad ProcrastinationSpanish TranslationArabic TranslationCatalan TranslationRussian TranslationSpanish Translation", "latitude": "61.22908", "longitude": "4.98466", "userId": 226, "storyId": 23, "halflife": 39}, {"title": "I hear and I forget. I see and I remember. I do and I understand.", "body": "What would happen if we did?At a minimum, we'd have to accept lower rates of technological    growth.", "latitude": "60.53945", "longitude": "120.61026", "userId": 45, "storyId": 11, "halflife": 77}, {"title": "Stay committed to your decisions, but stay flexible in your approach.", "body": "It may be time to fix that.)The reason this struck me so forcibly is that for most of the preceding 10 years I'd been able to think about what I wanted.", "latitude": "43.15306", "longitude": "40.9575", "userId": 40, "storyId": 73, "halflife": 43}, {"title": "Every problem has a gift for you in its hands.", "body": "[4]Now I would guess that practically every Stanford or Berkeley undergrad who knows how to program has at least considered the idea of starting a startup.", "latitude": "44.46667", "longitude": "14", "userId": 361, "storyId": 31, "halflife": 72}, {"title": "Think how hard physics would be if particles could think.", "body": "Because it's too easy for people who control a private company to funnel its revenues to themselves (e.g.", "latitude": "42.55461", "longitude": "116.24722", "userId": 143, "storyId": 37, "halflife": 27}, {"title": "One today is worth two tomorrows.", "body": "Fred Wilson to: Paul Graham, date: Sun, Jan 25, 2009 at 5:28 PM subject: Re: meet the airbedsThanks PaulWe are having a bit of a debate inside our partnership about the airbed concept.", "latitude": "49.65919", "longitude": "-81.27121", "userId": 239, "storyId": 33, "halflife": 51}, {"title": "Follow your instincts. That is where true wisdom manifests itself.", "body": "And unless you got the money by inheriting it or winning a lottery, you've already been thoroughly trained that self-indulgence leads to trouble.", "latitude": "43.15306", "longitude": "0.48478", "userId": 130, "storyId": 59, "halflife": 13}, {"title": "I'm not afraid of storms, for Im learning how to sail my ship.", "body": "If you're designing a tool, for example, you can design it for anyone from beginners to experts, and what's good design for one group might be bad for another.", "latitude": "48.60169", "longitude": "-77.28111", "userId": 69, "storyId": 69, "halflife": 26}, {"title": "Meaning is not what you start with but what you end up with.", "body": "I haven't read the essay, but there's no way anything so short and written in such an informal style could have anything useful to say about such and such topic, when people with degrees in the subject have already written many thick books about it.\"", "latitude": "54.26667", "longitude": "112.75806", "userId": 81, "storyId": 50, "halflife": 58}, {"title": "Better than a thousand hollow words is one word that brings peace.", "body": "Most people could see how it might be helpful to be in a place where there was infrastructure for startups, accumulated knowledge about how to make them work, and other people trying to do it.", "latitude": "16.95098", "longitude": "6.12878", "userId": 239, "storyId": 89, "halflife": 35}, {"title": "Know, first, who you are, and then adorn yourself accordingly.", "body": "The reason credentials have such prestige is that for so long the large organizations in a society tended to be the most powerful.", "latitude": "44.44968", "longitude": "105.84812", "userId": 28, "storyId": 17, "halflife": 54}, {"title": "We do what we do because we believe.", "body": "What I mean is, if you're starting a company that will do something cool, the aim had better be to make money  and maybe be cool, not to be cool and maybe make money.It's hard enough to make money that you can't do it by accident.", "latitude": "61.22908", "longitude": "12.25978", "userId": 428, "storyId": 77, "halflife": 9}, {"title": "Life is 10% what happens to you and 90% how you react to it.", "body": "There is an enormous latent capacity in the world's hackers that most people don't even realize is there.", "latitude": "-13.07361", "longitude": "7.6", "userId": 245, "storyId": 10, "halflife": 23}, {"title": "One today is worth two tomorrows.", "body": "One of the most surprising things I discovered during my brief business career was the existence of the PR industry, lurking like a huge, quiet submarine beneath the news.", "latitude": "44.25979", "longitude": "-81.9818", "userId": 54, "storyId": 73, "halflife": 63}, {"title": "The day always looks brighter from behind a smile.", "body": "Revealingly, the same term was used for both products and information:  there were distribution channels, and TV and radio channels.It was the narrowness of such channels that made professionals seem so superior to amateurs.", "latitude": "13.03643", "longitude": "-77.39997", "userId": 127, "storyId": 11, "halflife": 96}, {"title": "A short saying oft contains much wisdom.", "body": "There may even need to be replacements for campus social life (and oddly enough, YC even has aspects of that).You could replace high schools too, but there you face bureaucratic obstacles that would slow down a startup.", "latitude": "46.0993", "longitude": "9.10214", "userId": 176, "storyId": 51, "halflife": 60}, {"title": "Sometimes the biggest act of courage is a small one.", "body": "Because Google had a deeply felt sense of purpose:   a conviction to change the world for the better.", "latitude": "41.85878", "longitude": "-77.63638", "userId": 226, "storyId": 100, "halflife": 57}, {"title": "It's not what happens to you, but how you react to it that matters.", "body": "More precisely, the users' need has to give them sufficient activation energy to start using whatever you make, which can vary a lot.", "latitude": "20.37593", "longitude": "23.59099", "userId": 493, "storyId": 19, "halflife": 25}, {"title": "Speak low, if you speak love.", "body": "There are other 19 year olds who are 12 inside.There's a reason we have a distinct word \"adult\" for people over a certain age.", "latitude": "47.23711", "longitude": "29.13333", "userId": 36, "storyId": 1, "halflife": 76}, {"title": "To see things in the seed, that is genius.", "body": "People's problems are similar enough that nearly all the code you write this way will be reusable, and whatever isn't will be a small price to start out certain that you've reached the bottom of the well.", "latitude": "45.54596", "longitude": "4.29166", "userId": 244, "storyId": 6, "halflife": 33}, {"title": "Our strength grows out of our weaknesses.", "body": "That is the future of web startups.Thanks to Brian Oberkirch and Simon Willison for inviting me to  speak, and the crew at Carson Systems for making everything run smoothly.Japanese", "latitude": "55.21306", "longitude": "-3.96203", "userId": 161, "storyId": 56, "halflife": 15}, {"title": "I think and that is all that I am.", "body": "Instead, you should program in a high-level language, and have a compiler translate it into machine language for you.", "latitude": "-6.9193", "longitude": "-91.87434", "userId": 302, "storyId": 58, "halflife": 100}, {"title": "Never idealize others. They will never live up to your expectations.", "body": "The extreme case is probably literature; people studying literature rarely   say anything that would be of the slightest use to those producing it.Though the situation is better in the sciences, the overlap between the kind of work you're allowed to do and the kind of work that yields good languages is distressingly small.", "latitude": "46.92892", "longitude": "46.53956", "userId": 334, "storyId": 80, "halflife": 26}, {"title": "You can do what's reasonable or you can decide what's possible.", "body": "If you go to see the Mona Lisa, you'll probably be disappointed, because it's hidden behind a thick glass wall and surrounded by a frenzied crowd taking pictures of themselves in front of it.", "latitude": "51.99399", "longitude": "13.04841", "userId": 485, "storyId": 77, "halflife": 16}, {"title": "Yesterday I dared to struggle. Today I dare to win.", "body": "But the major parties know so well which issues matter how much to how many voters, and adjust their message so precisely in response, that they tend to split the difference on the issues, leaving the election to be decided by the one factor they can't control: charisma.If the Democrats had been running a candidate as charismatic as Clinton in the 2004 election, he'd have won.", "latitude": "15.48277", "longitude": "6.20504", "userId": 483, "storyId": 79, "halflife": 78}, {"title": "Things do not change; we change.", "body": "Paul BuchheitFew know this, but one person, Paul Buchheit, is responsible for three of the best things Google has done.", "latitude": "49.14696", "longitude": "104.50951", "userId": 446, "storyId": 77, "halflife": 40}, {"title": "Why worry about tomorrow, when today is all we have?", "body": "I don't think anyone would like programming in a language where all the variables were the letter x with integer subscripts.", "latitude": "29.385", "longitude": "118.50806", "userId": 232, "storyId": 4, "halflife": 64}, {"title": "A good rest is half the work.", "body": "And that power can be used for constructive purposes too: just as you can trick yourself into looking like a freak, you can trick yourself into creating something so grand that you would never have dared to plan such a thing.", "latitude": "15.95873", "longitude": "6.36117", "userId": 206, "storyId": 18, "halflife": 75}, {"title": "We do what we do because we believe.", "body": "If there's no one where you live who wants to start a startup with you, move where there are people who do.", "latitude": "49.24476", "longitude": "12.33711", "userId": 438, "storyId": 31, "halflife": 81}, {"title": "He who knows others is wise. He who knows himself is enlightened.", "body": "And yet whatever argument you use to prove that startups don't need to move from London to Silicon Valley could equally well be used to prove startups don't need to move from smaller towns to London.The difference between cities is a matter of degree.", "latitude": "50.69211", "longitude": "21.37751", "userId": 198, "storyId": 95, "halflife": 21}, {"title": "Today is the tomorrow we worried about yesterday.", "body": "Young founders are not a new phenomenon: the trend began as soon as computers got cheap enough for college kids to afford them.Another of our hypotheses was that you can start a startup on less money than most people think.", "latitude": "44.46667", "longitude": "124.31098", "userId": 393, "storyId": 93, "halflife": 65}, {"title": "To be wrong is nothing unless you continue to remember it.", "body": "So we shouldn't assume the way startups work now is the way they have to work.Fairchild needed a lot of money to get started.", "latitude": "41.4105", "longitude": "11.22419", "userId": 97, "storyId": 60, "halflife": 34}, {"title": "Be kind whenever possible. It is always possible.", "body": "Whereas if you're writing code to make it easy to reload     into your head, it may be best to go for brevity.", "latitude": "45.31667", "longitude": "153.2888", "userId": 273, "storyId": 8, "halflife": 68}, {"title": "Chaos is inherent in all compounded things. Strive on with diligence.", "body": "But the usual way of calculating real income ignores much of the growth in wealth over time, because it depends on a consumer price index created by bolting end to end a series of numbers that are only locally accurate, and that don't include the prices of new inventions until they become so common that their prices stabilize.So while we might think it was very much better to live in a world with antibiotics or air travel or an electric power grid than without, real income statistics calculated ", "latitude": "23.10787", "longitude": "4.44474", "userId": 155, "storyId": 41, "halflife": 19}, {"title": "You cannot travel the path until you have become the path itself.", "body": "Larry Page and Sergey Brin were grad students in computer science, which presumably makes them \"engineers.\"", "latitude": "6.95508", "longitude": "-84.59103", "userId": 306, "storyId": 39, "halflife": 9}, {"title": "A good rest is half the work.", "body": "Though the first philosophers in the western tradition lived about 2500 years ago, it would be misleading to say the field is 2500 years old, because for most of that time the leading practitioners weren't doing much more than writing commentaries on Plato or Aristotle while watching over their shoulders for the next invading army.", "latitude": "38.87094", "longitude": "8.58306", "userId": 249, "storyId": 99, "halflife": 90}, {"title": "Think as a wise man but communicate in the language of the people.", "body": "Their other interests leave them little attention to spare for popularity, and since popularity resembles a zero-sum game, this in turn makes them targets for the whole school.", "latitude": "-11.50139", "longitude": "37.95805", "userId": 331, "storyId": 64, "halflife": 2}, {"title": "Wherever a man turns he can find someone who needs him.", "body": "Is this, of all the things we could make, the thing people will pay most for?MuckThe second mistake we made with Artix is also very common.", "latitude": "41.8691", "longitude": "0.67134", "userId": 281, "storyId": 85, "halflife": 39}, {"title": "Mistakes are always forgivable, if one has the courage to admit them.", "body": "It was this, more than Raphael's own work, that bothered the Pre-Raphaelites.The ambitious are not content to imitate.", "latitude": "38.85611", "longitude": "-79.85755", "userId": 111, "storyId": 92, "halflife": 81}, {"title": "Everything has beauty, but not everyone sees it.", "body": "How many corporate lawyers would do their current work if they had to do it for free, in their spare time, and take day jobs as waiters to support themselves?This", "latitude": "42.02004", "longitude": "18.34857", "userId": 182, "storyId": 30, "halflife": 10}, {"title": "Victory belongs to the most persevering.", "body": "Its  fifteen most interesting words are as follows:  continuation  0.01 describe      0.01 continuations 0.01 example       0.033600237 programming   0.05214485  i'm           0.055427782 examples      0.07972858  color         0.9189189   localhost     0.09883721 hi            0.116539136 california    0.84421706 same          0.15981844 spot          0.1654587 us-ascii      0.16804294 what          0.19212411  Most of the words here indicate the mail is an innocent one.", "latitude": "9.62168", "longitude": "-2.47776", "userId": 291, "storyId": 50, "halflife": 41}, {"title": "I hear and I forget. I see and I remember. I do and I understand.", "body": "The great fortunes of that time still derived more from what we would now call corruption than from commerce.", "latitude": "47.90397", "longitude": "-80.13893", "userId": 265, "storyId": 30, "halflife": 10}, {"title": "Learning is a treasure that will follow its owner everywhere", "body": "Exactly the opposite, in fact: you should only start a startup with someone you like, because a startup will put your friendship through a stress test.", "latitude": "51.59599", "longitude": "2.23698", "userId": 425, "storyId": 75, "halflife": 30}, {"title": "I believe that every person is born with talent.", "body": "And someone has to argue with you, because everyone has base impulses, and if you have more will than discipline you'll just give into them and end up on a local maximum like drug addiction.We can imagine will and discipline as two fingers squeezing a slippery melon seed.", "latitude": "52.13847", "longitude": "105.87266", "userId": 90, "storyId": 34, "halflife": 62}, {"title": "There is no way to happiness, happiness is the way.", "body": "According to Sports Illustrated, the average NBA player's salary during the 2002-03 season was $4.54 million, and the average major league baseball player's salary at the start of the 2003 season was $2.56 million.", "latitude": "36.65629", "longitude": "-79.17724", "userId": 82, "storyId": 60, "halflife": 71}, {"title": "No man can succeed in a line of endeavor which he does not like.", "body": "As I've written elsewhere, by using Lisp, which many people still consider  a research language, we could make the Viaweb editor behave more like desktop software.ReleasesOne of the most important changes in this new world is the way you do releases.", "latitude": "19.80111", "longitude": "1.92094", "userId": 498, "storyId": 79, "halflife": 45}, {"title": "The best way to pay for a lovely moment is to enjoy it.", "body": "Market.So while on average public acquirers behave like pooled-risk company managers, you need a window of several years to get average case performance.", "latitude": "32.79396", "longitude": "93.78845", "userId": 345, "storyId": 83, "halflife": 33}, {"title": "Arriving at one point is the starting point to another.", "body": "And yet because of the scale of the successes in the startup business, VCs can still make money from such investments.", "latitude": "49.90333", "longitude": "6.95833", "userId": 257, "storyId": 83, "halflife": 78}, {"title": "The greatest remedy for anger is delay.", "body": "But they might as well be from a venture investor's point of view, and they suck up just as much time and attention as the successes.", "latitude": "51.75325", "longitude": "40.9575", "userId": 349, "storyId": 52, "halflife": 29}, {"title": "They can do all because they think they can.", "body": "Everyone else will move.Observation bears this out: within the US, towns have become startup hubs if and only if they have both rich people and nerds.", "latitude": "37.47528", "longitude": "124.39472", "userId": 249, "storyId": 49, "halflife": 82}, {"title": "The two most powerful warriors are patience and time.", "body": "It's a rare startup that doesn't build something the founders use.The main reason there are so many iPhone apps is that so many programmers have iPhones.", "latitude": "41.87023", "longitude": "11.12319", "userId": 416, "storyId": 46, "halflife": 48}, {"title": "Don't be afraid to go out on a limb. That's where the fruit is.", "body": "And yet those who dislike the term are probably right, because if it means what I think it does, we don't need it.I first heard the phrase \"Web 2.0\" in the name of the Web 2.0 conference in 2004.", "latitude": "43.52774", "longitude": "21.37751", "userId": 334, "storyId": 82, "halflife": 56}, {"title": "No one has ever become poor by giving.", "body": "Advanced users are more forgiving about bugs, especially since you probably introduced them in the course of adding some feature they were asking for.", "latitude": "47.66939", "longitude": "120.0112", "userId": 381, "storyId": 79, "halflife": 37}, {"title": "Love is the master key that opens the gates of happiness.", "body": "It's not far from saying that Python's goal is not to be effective  as a programming language.Does succinctness = power?", "latitude": "15.3", "longitude": "7.17606", "userId": 33, "storyId": 93, "halflife": 6}, {"title": "It can't be spring if your heart is filled with past failures.", "body": "As huge as their companies eventually became, they were all essentially mechanics and shopkeepers at first.", "latitude": "47.87751", "longitude": "8.60561", "userId": 82, "storyId": 16, "halflife": 82}, {"title": "Trusting our intuition often saves us from disaster.", "body": "But the more you realize that most judgements are greatly influenced by random, extraneous factors?that most people judging you are more like a fickle novel buyer than a wise and perceptive  magistrate?the more you realize you can do things to influence the outcome.One good place to apply this principle is in college applications.", "latitude": "40.69497", "longitude": "97.1507", "userId": 51, "storyId": 99, "halflife": 16}, {"title": "Accept challenges, so that you may feel the exhilaration of victory.", "body": "If you're worried that your current job is rotting your brain, it probably is.The best hackers tend to be smart, of course, but that's true in a lot of fields.", "latitude": "40.95251", "longitude": "-111.94877", "userId": 223, "storyId": 8, "halflife": 66}, {"title": "Write your plans in pencil and give God the eraser.", "body": "If I had a choice of (a) spending the next hour working on something or (b) be teleported to Rome and spend the next hour wandering about, was there any sort of work I'd prefer?", "latitude": "50.63678", "longitude": "8.78762", "userId": 355, "storyId": 66, "halflife": 64}, {"title": "We lost because we told ourselves we lost.", "body": "I don't think the rise of yuppies was inspired by it; it seems more as if there was a change in the social conventions (and perhaps the laws) governing the way big companies worked.", "latitude": "-7.0907", "longitude": "-77.78748", "userId": 274, "storyId": 83, "halflife": 73}, {"title": "You can do it if you believe you can!", "body": "Now survival is the default, instead of dying.A morale boost on that scale is very valuable in a startup, because the moral weight of running a startup is what makes it hard.", "latitude": "39.88722", "longitude": "6.12878", "userId": 93, "storyId": 70, "halflife": 37}, {"title": "Remember that failure is an event, not a person.", "body": "Confucius claimed proudly that he had never invented anything?that he had simply passed on an accurate account of ancient traditions.", "latitude": "15.1719", "longitude": "12.49151", "userId": 494, "storyId": 92, "halflife": 84}, {"title": "He who is contented is rich.", "body": "So an artist working on a painting and trying to decide whether to change some part of it doesn't have to think \"Why bother?", "latitude": "40.0115", "longitude": "-98.21694", "userId": 242, "storyId": 85, "halflife": 65}, {"title": "Beauty is not in the face; beauty is a light in the heart.", "body": "The reason those stimuli caused those founders to start companies was that their experiences had prepared them to notice the opportunities they represented.The verb you want to be using with respect to startup ideas is not \"think up\" but \"notice.\"", "latitude": "-4.39143", "longitude": "91.27322", "userId": 493, "storyId": 93, "halflife": 97}, {"title": "Be the change that you want to see in the world.", "body": "I remember talking to some programmers in the cafeteria about the problem of gaming search results (now known as SEO), and they asked \"what should we do?\"", "latitude": "45.21585", "longitude": "102.08825", "userId": 203, "storyId": 79, "halflife": 51}, {"title": "To bring anything into your life, imagine that it's already there.", "body": "System administrators can become cranky and unresponsive because they're not directly exposed to competitive pressure:  a salesman has to deal with customers, and a developer has to deal with competitors' software, but a system administrator, like an old bachelor, has few external forces to keep him in line.", "latitude": "45.8514", "longitude": "120.29108", "userId": 48, "storyId": 70, "halflife": 25}, {"title": "As you think, so shall you become.", "body": "What popularity it retains dates back to the 1960s and 1970s, when it was the scripting language of MIT.", "latitude": "-33.73333", "longitude": "24.66302", "userId": 388, "storyId": 2, "halflife": 61}, {"title": "If you can dream it, you can do it.", "body": "We don't know exactly what happens when they die, because they generally don't die loudly and heroically.", "latitude": "48.60169", "longitude": "-98.3525", "userId": 131, "storyId": 10, "halflife": 38}, {"title": "Knowing is not enough; we must apply!", "body": "The most obvious difference between real essays and the things one has to write in school is that real essays are not exclusively about English literature.", "latitude": "33.85455", "longitude": "21.91667", "userId": 279, "storyId": 39, "halflife": 87}, {"title": "A man who doesn't trust himself can never really trust anyone else.", "body": "Perl programs can be almost cryptically dense, while the names of built-in Common Lisp operators are comically long.", "latitude": "45.12085", "longitude": "10.06299", "userId": 400, "storyId": 49, "halflife": 99}, {"title": "Whatever happens, take responsibility.", "body": "So the deals take longer, dilute you more, and impose more onerous conditions.Sometimes the VCs want to install a new CEO of their own choosing.", "latitude": "23.25021", "longitude": "117.4484", "userId": 211, "storyId": 55, "halflife": 35}, {"title": "Today is the tomorrow we worried about yesterday.", "body": "There's nothing special about physical embodiments of control systems that should make them patentable, and the software equivalent not.Unfortunately, patent law is inconsistent on this point.", "latitude": "47.29143", "longitude": "-80.74222", "userId": 231, "storyId": 23, "halflife": 62}, {"title": "The eye sees only what the mind is prepared to comprehend.", "body": "I'd rather offend people than pander to them,  and if you write about controversial topics you have to choose one or the other.", "latitude": "46.0627", "longitude": "101.87959", "userId": 391, "storyId": 85, "halflife": 71}, {"title": "The path to success is to take massive, determined action.", "body": "If you're the sort of person who would like to solve the money problem once and for all instead of working  for a salary for 40 years, then a startup makes sense.For a lot of people the conflict is between startups and graduate school.", "latitude": "28.42522", "longitude": "37.85425", "userId": 413, "storyId": 99, "halflife": 16}, {"title": "The best teacher is experience learned from failures.", "body": "But not always: sometimes the startup cobbles together a syndicate of investors who approach them independently, and the startup's lawyer supplies the paperwork.The easiest way to get started in angel investing is to find a friend who already does it, and try to get included in his syndicates.", "latitude": "52.18767", "longitude": "-3.58195", "userId": 104, "storyId": 89, "halflife": 3}, {"title": "Life is a succession of moments. To live each one is to succeed.", "body": "experience of the SFP suggests that if you let motivated people do real work, they work hard, whatever their age.", "latitude": "26.16753", "longitude": "12.1176", "userId": 171, "storyId": 62, "halflife": 10}, {"title": "The journey of a thousand miles begins with one step.", "body": "And if you're writing a short, throwaway program, you may be better off just using whatever language has the best library functions for the task.", "latitude": "53.12771", "longitude": "-3.48632", "userId": 81, "storyId": 51, "halflife": 29}, {"title": "If you can't feed a hundred people, then feed just one.", "body": "This is just a guess, but my guess is that the winning model for most applications will be purely server-based.", "latitude": "45.05", "longitude": "35.95783", "userId": 303, "storyId": 67, "halflife": 47}, {"title": "Real magic in relationships means an absence of judgement of others.", "body": "Search was now only a small percentage of our page views, less than one month's growth, and now that we were established as a \"media    company,\" or \"portal,\" or whatever we were, search could safely be allowed to wither and drop off, like an umbilical cord.Well, a small fraction of page views they may be, but they are an   important fraction, because they are the page views that Web sessions   start with.", "latitude": "49.63829", "longitude": "5.0778", "userId": 58, "storyId": 54, "halflife": 22}, {"title": "If you do not change direction, you may end up where you are heading.", "body": "The PR campaign leading up to Netscape's IPO was running full blast then, and there was a lot of talk in the press about online commerce.", "latitude": "42.99611", "longitude": "125.60401", "userId": 147, "storyId": 88, "halflife": 49}, {"title": "Anybody can make history. Only a great man can write it.", "body": "There's no switch inside you that magically flips when you turn a certain age or graduate from some institution.", "latitude": "49.4234", "longitude": "-3.94365", "userId": 95, "storyId": 75, "halflife": 37}, {"title": "The heart has its reasons which reason knows not of.", "body": "Idealistic undergraduates find their unconsciously preserved child's model of wealth confirmed by eminent writers of the past.", "latitude": "7.15444", "longitude": "-3.02261", "userId": 334, "storyId": 84, "halflife": 72}, {"title": "I'm not afraid of storms, for Im learning how to sail my ship.", "body": "Across industries and countries, there's a strong inverse correlation between performance and job security.", "latitude": "34.61738", "longitude": "-79.85755", "userId": 133, "storyId": 7, "halflife": 5}, {"title": "Do what you can. Want what you have. Be who you are.", "body": "The worst problem was that they hired bad programmers.Microsoft (back in the day), Google, and Facebook have all been obsessed with hiring the best programmers.", "latitude": "44.44968", "longitude": "112.2957", "userId": 277, "storyId": 29, "halflife": 72}, {"title": "I never think of the future. It comes soon enough.", "body": "Give the founders enough autonomy that they can grow the acquisition into what it would have become.Thanks to Sam Altman, Paul Buchheit, David Hornik, Jessica  Livingston, Robert Morris, and Fred Wilson for reading drafts of this.Russian Translation", "latitude": "6.95508", "longitude": "6.85", "userId": 238, "storyId": 34, "halflife": 56}, {"title": "We must not allow ourselves to become like the system we oppose.", "body": "Economically, the fact that established companies can't simply eliminate new competitors may be one of the most valuable aspects of the rule of law.", "latitude": "-7.35", "longitude": "-114.99933", "userId": 202, "storyId": 23, "halflife": 58}, {"title": "The price of greatness is responsibility.", "body": "Common Lisp I have often wanted to iterate through the fields of a struct-- to comb out references to a deleted object, for example, or find fields that are uninitialized.", "latitude": "-6.8741", "longitude": "12.30081", "userId": 134, "storyId": 12, "halflife": 100}, {"title": "I know but one freedom and that is the freedom of the mind.", "body": "When a startup both begins with an idea exposed by technological change and makes a product consisting of technology in the narrower sense (what used to be called \"high technology\"), it's easy to conflate the two.", "latitude": "44.46667", "longitude": "57.65865", "userId": 461, "storyId": 63, "halflife": 28}, {"title": "A man sees in the world what he carries in his heart.", "body": "Most successful startups end up doing something different than they originally intended?often so different that it doesn't even seem like the same company.", "latitude": "24.58919", "longitude": "7.17606", "userId": 9, "storyId": 8, "halflife": 23}, {"title": "When you doubt your power, you give power to your doubt.", "body": "Spam filtering is not just classification, because false positives are so much worse than false negatives that you should treat them as a different kind of error.", "latitude": "48.40288", "longitude": "69.18235", "userId": 481, "storyId": 1, "halflife": 71}, {"title": "You cannot be lonely if you like the person you're alone with.", "body": "Some I only learned in the past year.Teaching hackers how to deal with investors is probably the second most important thing we do at Y Combinator.", "latitude": "44.99489", "longitude": "3.1915", "userId": 315, "storyId": 30, "halflife": 90}, {"title": "Worry often gives a small thing a big shadow.", "body": "you work your way down the Forbes 400 making an x next to the    name of each person with an MBA, you'll learn something important about business school.", "latitude": "49.63829", "longitude": "113.4222", "userId": 329, "storyId": 27, "halflife": 28}, {"title": "Real success is finding your lifework in the work that you love.", "body": "He's not just generally correct, but also correct about how correct he is.You'd think it would be such a great thing never to be wrong that everyone would do this.", "latitude": "53.03333", "longitude": "6.20504", "userId": 101, "storyId": 65, "halflife": 2}, {"title": "The best place to find a helping hand is at the end of your own arm.", "body": "I'm guessing here, but I'd guess that many of these would-be founders may not have the kind of determination it takes to start a company, and that in the back of their minds, they know it.", "latitude": "57.6935", "longitude": "7.91667", "userId": 150, "storyId": 91, "halflife": 75}]