[{"title": "Learn from yesterday, live for today, hope for tomorrow.", "body": "For the same reason that the probably apocryphal violinist, whenever he was asked to judge someone's playing, would always say they didn't have enough talent to make it as a pro.", "latitude": "47.26775", "longitude": "-70.5509", "userId": 494, "storyId": 38, "halflife": 16}, {"title": "My reputation grows with every failure.", "body": "A painting familiar from reproductions looks more familiar from ten feet away; close in you see details that get lost in reproductions, and which you're therefore seeing for the first time.There are two main kinds of error that get in the way of seeing a work of art: biases you bring from your own circumstances, and tricks played by the artist.", "latitude": "34.0725", "longitude": "40.48539", "userId": 113, "storyId": 55, "halflife": 1}, {"title": "Patience is the companion of wisdom.", "body": "Occasionally the things adults made you do were fun, just as, occasionally, playing wasn't?for example, if you fell and hurt yourself.", "latitude": "53.32417", "longitude": "8.33333", "userId": 264, "storyId": 27, "halflife": 50}, {"title": "There is no way to happiness, happiness is the way.", "body": "One of the things you learn when you analyze spam texts is how narrow a subset of the language spammers operate in.", "latitude": "20.47841", "longitude": "114.0086", "userId": 360, "storyId": 73, "halflife": 9}, {"title": "Every man is a volume if you know how to read him.", "body": "Even Samuel Johnson seems to have balked at this, on the one   hand paying Milton the compliment of an extensive biography, and on the other writing of Paradise Lost that \"none who read it ever wished it longer.\"", "latitude": "43.56805", "longitude": "-98.8642", "userId": 459, "storyId": 19, "halflife": 36}, {"title": "We lost because we told ourselves we lost.", "body": "I'm not sure why?probably some combination of the increasing power of women, the increasing influence of actors as models, and the fact that so many people work in offices now: you can't show off by wearing clothes too fancy to wear in a factory, so you have to show off with your body instead.Hipness is another thing you wouldn't have seen on the list 100 years ago.", "latitude": "36.1534", "longitude": "38.66261", "userId": 263, "storyId": 13, "halflife": 44}, {"title": "Experience is simply the name we give our mistakes.", "body": "There are some towns, like Portland, that would be easy to turn into startup hubs, and others, like Detroit, where it would really be an uphill battle.", "latitude": "53.30966", "longitude": "14.17329", "userId": 478, "storyId": 44, "halflife": 26}, {"title": "Most smiles are started by another smile.", "body": "In old hackers, skepticism predominates, and they won't even dare to take on ambitious projects.Anything you can do to keep the redesign cycle going is good.", "latitude": "48.3", "longitude": "7.44153", "userId": 92, "storyId": 6, "halflife": 63}, {"title": "A goal without a plan is just a wish.", "body": "Thanks to Trevor Blackwell, Robert Morris, Dan Giffin, and Lisa Randall for reading drafts of this, and to Henry Leitner and Larry Finkelstein for inviting me to speak.Japanese", "latitude": "45.38732", "longitude": "122.37231", "userId": 489, "storyId": 56, "halflife": 41}, {"title": "If one does not know to which port is sailing, no wind is favorable.", "body": "FREE Free free                If you do this, be sure to consider versions with initial caps as well as all uppercase and all lowercase.", "latitude": "-16.81978", "longitude": "126.55224", "userId": 109, "storyId": 11, "halflife": 81}, {"title": "Three things cannot be long hidden: the sun, the moon, and the truth.", "body": "In the first batch of startups we funded, in the summer of 2005, most of the founders spent all their time building their applications.", "latitude": "-21.18694", "longitude": "-76.57052", "userId": 455, "storyId": 60, "halflife": 6}, {"title": "It is never too late to be what you might have been.", "body": "I were going to start a startup today, there are only three    places I'd consider doing it: on the Red Line near Central, Harvard, or Davis Squares (Kendall is too sterile); in Palo Alto on University or California Aves; and in Berkeley immediately north or south of    campus.", "latitude": "50.33333", "longitude": "7.81667", "userId": 204, "storyId": 92, "halflife": 30}, {"title": "Do not turn back when you are just at the goal.", "body": "This is understandable with angels; they invest on a smaller scale and don't like to have too much money tied up in any one deal.", "latitude": "48.4296", "longitude": "33.9968", "userId": 382, "storyId": 96, "halflife": 49}, {"title": "Never idealize others. They will never live up to your expectations.", "body": "And as many programmers have observed since, one is very often mistaken about where these bottlenecks are.So, in practice, the way to get fast code is to have a very good profiler, rather than by, say, making the language strongly typed.", "latitude": "28.858", "longitude": "23.62842", "userId": 483, "storyId": 35, "halflife": 97}, {"title": "The world makes way for the man who knows where he is going.", "body": "The buyer is going to make a lot of those low, low payments; and  the programmer is going to read a lot of those individually readable lines.This tradeoff predates programming languages.", "latitude": "29.09496", "longitude": "-78.06667", "userId": 155, "storyId": 92, "halflife": 74}, {"title": "Know, first, who you are, and then adorn yourself accordingly.", "body": "Though indeed, making things cheaper often turns out to generate more money in the end, just as automating things often turns out to generate more jobs.The ultimate target is Microsoft.", "latitude": "-27.03786", "longitude": "17.15639", "userId": 477, "storyId": 57, "halflife": 3}, {"title": "As you think, so shall you become.", "body": "And finally, since a few good hackers have unbearable personalities,    could we stand to have them around?That", "latitude": "49.86997", "longitude": "-82.09011", "userId": 158, "storyId": 10, "halflife": 15}, {"title": "From wonder into wonder existence opens.", "body": "And it's particularly necessary for younger founders to work long hours because they're probably not as efficient as they'll be later.Your second advantage, poverty, might not sound like an advantage, but it is a huge one.", "latitude": "27.46801", "longitude": "68.28666", "userId": 348, "storyId": 57, "halflife": 90}, {"title": "Life is a succession of moments. To live each one is to succeed.", "body": "I feel like I'm reading a description of something that actually happened.I used to read a lot of novels when I was younger.", "latitude": "42.87881", "longitude": "-51.84389", "userId": 340, "storyId": 3, "halflife": 99}, {"title": "He who knows himself is enlightened.", "body": "One of the reasons \"Web 2.0\" has such an air of euphoria about it is the feeling, conscious or not, that this era of monopoly may finally be over.Of course, as a hacker I can't help thinking about how something broken could be fixed.", "latitude": "37.38938", "longitude": "14.30591", "userId": 380, "storyId": 39, "halflife": 41}, {"title": "Experience is simply the name we give our mistakes.", "body": "You can use text classification techniques, but solutions can and should reflect the fact that the text is email, and spam in particular.", "latitude": "37.5741", "longitude": "-98.11972", "userId": 252, "storyId": 65, "halflife": 35}, {"title": "Every man dies. Not every man really lives.", "body": "But you can tell it must be hard by how few startups do it.Because making something people want is so much harder than making money from it, you should leave business models for later, just as you'd leave some trivial but messy feature for version 2.", "latitude": "14.77222", "longitude": "138.65059", "userId": 445, "storyId": 25, "halflife": 18}, {"title": "One today is worth two tomorrows.", "body": "At the top schools, I'd guess as many as a quarter of the CS majors could make it as startup founders if they wanted.That \"if they wanted\" is an important qualification?so important that it's almost cheating to append it like that?because once you get over a certain threshold of intelligence, which most CS majors at top schools are past, the deciding factor in whether you succeed as a founder is how much you want to.", "latitude": "35.10371", "longitude": "100.59656", "userId": 251, "storyId": 8, "halflife": 12}, {"title": "Smile, breathe and go slowly.", "body": "The government could not do better than to piggyback on their expertise, and use investment by recognized startup investors as the test of whether a company was a real startup.How would the government decide who's a startup investor?", "latitude": "55.81971", "longitude": "5.02409", "userId": 104, "storyId": 88, "halflife": 77}, {"title": "We never live; we are always in the expectation of living.", "body": "So an artist working on a painting and trying to decide whether to change some part of it doesn't have to think \"Why bother?", "latitude": "48.16797", "longitude": "15.20122", "userId": 171, "storyId": 86, "halflife": 99}, {"title": "Our intention creates our reality.", "body": "I've already said at least one thing that would have gotten me in big trouble in most of Europe in the seventeenth century, and did get Galileo in big trouble when he said it-- that the earth moves.", "latitude": "43.18865", "longitude": "-115.10534", "userId": 20, "storyId": 32, "halflife": 58}, {"title": "Never mistake activity for achievement.", "body": "The point of programming languages is to prevent our poor frail human brains from being  overwhelmed by a mass of detail.Architects know that some kinds of design problems are more personal than others.", "latitude": "24.5117", "longitude": "79.24516", "userId": 137, "storyId": 78, "halflife": 72}, {"title": "Do one thing every day that scares you.", "body": "Except this is not a boss you can escape by starting your own company.The problem with working slowly is not just that technical innovation happens slowly.", "latitude": "51.51505", "longitude": "120.63572", "userId": 243, "storyId": 58, "halflife": 44}, {"title": "Silence is deep as Eternity, Speech is shallow as Time.", "body": "As I've written elsewhere, by using Lisp, which many people still consider  a research language, we could make the Viaweb editor behave more like desktop software.ReleasesOne of the most important changes in this new world is the way you do releases.", "latitude": "47.86614", "longitude": "7.69708", "userId": 489, "storyId": 73, "halflife": 38}, {"title": "Keep your eyes on the stars and your feet on the ground.", "body": "Startups can die from releasing something full of bugs, and not fixing them fast enough, but I don't know of any that died from releasing something stable but minimal very early, then promptly improving it.[2] I know this is why I haven't released Arc.", "latitude": "41.73657", "longitude": "8.97161", "userId": 101, "storyId": 49, "halflife": 14}, {"title": "Reality does not conform to the ideal, but confirms it.", "body": "Telling me that I didn't want to be popular would have seemed like telling someone dying of thirst in a desert that he didn't want a glass of water.", "latitude": "51.12598", "longitude": "112.91207", "userId": 379, "storyId": 86, "halflife": 12}, {"title": "We know what we are, but know not what we may be.", "body": "But a hacker can learn quickly enough that car means the first element of a list and cdr means the rest.", "latitude": "40.30064", "longitude": "-111.76099", "userId": 457, "storyId": 52, "halflife": 11}, {"title": "Society develops wit, but its contemplation alone forms genius.", "body": "There probably aren't more than a couple hundred serious angels in the whole Valley, and yet they're probably the single most important ingredient in making the Valley what it is.", "latitude": "44.14333", "longitude": "-5.50535", "userId": 69, "storyId": 84, "halflife": 46}, {"title": "The best teacher is experience learned from failures.", "body": "At one end you have people who are really mathematicians, but call what they're doing computer science so they can get DARPA grants.", "latitude": "45.6927", "longitude": "-78.39085", "userId": 281, "storyId": 92, "halflife": 17}, {"title": "Great talent finds happiness in execution.", "body": "November 2005In the next few years, venture capital funds will find themselves squeezed from four directions.", "latitude": "49.32446", "longitude": "1.58278", "userId": 18, "storyId": 34, "halflife": 100}, {"title": "To bring anything into your life, imagine that it's already there.", "body": "Look around you and see what the smart people seem to be working on; there's usually a reason.Some of the smartest people around you are professors.", "latitude": "42.51069", "longitude": "8.34532", "userId": 26, "storyId": 5, "halflife": 41}, {"title": "The path to success is to take massive, determined action.", "body": "people can experience now what Darwin's contemporaries did when The Origin of Species was first published, because everyone now is raised either to take evolution for granted, or to regard it as a heresy.", "latitude": "45.9952", "longitude": "3.26345", "userId": 403, "storyId": 45, "halflife": 67}, {"title": "Every day may not be good, but there's something good in every day.", "body": "Obviously that's false: anything else people make can be well or badly designed; why should this be uniquely impossible for programming languages?", "latitude": "42.61771", "longitude": "-90.24537", "userId": 283, "storyId": 86, "halflife": 41}, {"title": "Those who will play with cats must expect to be scratched.", "body": "The buildings are all more or less the same, their exteriors express very little, and they are arranged in a confusing maze.", "latitude": "35.05954", "longitude": "-75.82667", "userId": 340, "storyId": 19, "halflife": 71}, {"title": "It takes both sunshine and rain to make a rainbow.", "body": "But this is probably not an option for most magazines.I don't know exactly what the future will look like, but I'm not too worried about it.", "latitude": "51.21875", "longitude": "-87.9036", "userId": 276, "storyId": 53, "halflife": 81}, {"title": "Anticipate the difficult by managing the easy.", "body": "If a super-angel gets 10x in one year, that's a higher rate of return than a VC could ever hope to get from a company that took 6 years to go public.", "latitude": "42.31607", "longitude": "1.58278", "userId": 367, "storyId": 18, "halflife": 2}, {"title": "To be wronged is nothing unless you continue to remember it.", "body": "With some degrees, like MDs and PhDs, you may not finish your training till 30.Teenagers now are useless, except as cheap labor in industries like fast food, which evolved to exploit precisely this fact.", "latitude": "41.78167", "longitude": "5.48624", "userId": 460, "storyId": 49, "halflife": 38}, {"title": "Your future depends on many things, but mostly on you.", "body": "If you asked the pointy-haired boss in 1992 what language      software should be written in, he would have answered with as little hesitation as he does today.", "latitude": "43.37573", "longitude": "-107.95778", "userId": 29, "storyId": 62, "halflife": 43}, {"title": "What you do not want done to yourself, do not do to others.", "body": "Can a language compel programmers to write code that's short (in elements) at the expense of overall readability?One", "latitude": "12.10769", "longitude": "-72.42453", "userId": 466, "storyId": 37, "halflife": 49}, {"title": "Freedom is what you do with what's been done to you.", "body": "The problem in high school is that your peers are chosen for you by     accidents of age and geography, rather than by you based on respect for their judgement.[5]", "latitude": "25.54277", "longitude": "-120.61325", "userId": 468, "storyId": 70, "halflife": 74}, {"title": "Doing nothing is better than being busy doing nothing.", "body": "Plus I think they underestimate themselves: they think back to how easy it felt to ride that huge thermal upward, and they think \"anyone could have done it.\"", "latitude": "9.7417", "longitude": "71.25976", "userId": 368, "storyId": 51, "halflife": 39}, {"title": "From little acorns mighty oaks do grow.", "body": "Perhaps what practice does is train your unconscious mind to handle tasks that used to require conscious thought.", "latitude": "35.7423", "longitude": "12.61444", "userId": 300, "storyId": 88, "halflife": 55}, {"title": "Don't wait. The time will never be just right.", "body": "Perhaps the CEO or the professional athlete has only ten times (whatever that means) the skill and determination of an ordinary person.", "latitude": "50.91667", "longitude": "-1.8621", "userId": 152, "storyId": 24, "halflife": 74}, {"title": "Just trust yourself, then you will know how to live.", "body": "I think most people in the technology world not only recognize this cartoon character, but know the actual person in their company that he is modelled upon.The pointy-haired boss miraculously combines two qualities that are common by themselves, but rarely seen together: (a) he knows nothing whatsoever about technology, and (b) he has very strong opinions about it.Suppose, for example, you need to write a piece of software.", "latitude": "45.01131", "longitude": "16.26267", "userId": 257, "storyId": 37, "halflife": 52}, {"title": "The heart has eyes which the brain knows nothing of.", "body": "Odds are you would have.Back in the era of terms like \"well-adjusted,\" the idea seemed to be that there was something wrong with you if you thought things you didn't dare say out loud.", "latitude": "53.44295", "longitude": "-115.10534", "userId": 500, "storyId": 82, "halflife": 66}, {"title": "You give before you get.", "body": "It's easy to be drawn into imitating flaws, because they're easier to see, and of course easier to copy too.", "latitude": "26.53153", "longitude": "122.90944", "userId": 160, "storyId": 58, "halflife": 4}, {"title": "Reason and free inquiry are the only effectual agents against error.", "body": "So the previously sharp line between angels and VCs has become hopelessly blurred.There used to be a no man's land between angels and VCs.", "latitude": "45.56667", "longitude": "74.4425", "userId": 162, "storyId": 36, "halflife": 90}, {"title": "In order to win, you must expect to win.", "body": "Ten weeks later we invite all the investors we know to hear them present what they've built so far.Ten weeks is not much time.", "latitude": "48.42983", "longitude": "0.65739", "userId": 62, "storyId": 20, "halflife": 36}, {"title": "Don't let what you can't do stop you from doing what you can do.", "body": "The word \"startup\"  dates from the 1960s, but what happens in one is  very similar to the venture-backed trading voyages of the Middle Ages.Startups usually involve technology, so much so that the phrase \"high-tech startup\" is almost redundant.", "latitude": "-20.31833", "longitude": "-0.5", "userId": 43, "storyId": 29, "halflife": 32}, {"title": "You can do it if you believe you can!", "body": "I got to the point of saying that this was hard to judge for yourself and that you should seek outside advice, before realizing that that's what we do.", "latitude": "56.03333", "longitude": "-76.68497", "userId": 316, "storyId": 31, "halflife": 52}, {"title": "A good rest is half the work.", "body": "Ordinary users shouldn't even know the words \"operating system,\" much less \"device driver\" or \"patch.\"There is now another way to deliver software that will save users from becoming system administrators.", "latitude": "15.55278", "longitude": "-2.74425", "userId": 153, "storyId": 60, "halflife": 42}, {"title": "Every problem has a gift for you in its hands.", "body": "Life tends to get more expensive as you get older, so it's easy to get sucked into working longer than you expected at the money job.", "latitude": "53.44295", "longitude": "-80.62798", "userId": 134, "storyId": 93, "halflife": 10}, {"title": "Why worry about tomorrow, when today is all we have?", "body": "Steve JobsPeople alive when Kennedy was killed  usually remember exactly where they were when they heard about it.", "latitude": "24.5117", "longitude": "85.93154", "userId": 181, "storyId": 48, "halflife": 7}, {"title": "It isn't where you come from, it's where you're going that counts.", "body": "What's not a theory is the converse: if you're trying to solve problems you don't understand, you're hosed.And yet a surprising number of founders seem willing to assume that someone, they're not sure exactly who, will want what they're building.", "latitude": "38.45005", "longitude": "115.65193", "userId": 497, "storyId": 33, "halflife": 60}, {"title": "Moments of complete apathy are the best for new creations.", "body": "Well, you can manufacture them by taking any project usually done by multiple people and trying to do it all yourself.", "latitude": "61.54222", "longitude": "11.51146", "userId": 424, "storyId": 51, "halflife": 37}, {"title": "The path to success is to take massive, determined action.", "body": "If you have something that no competitor does and that some subset of users urgently need, you have a beachhead.", "latitude": "45.09678", "longitude": "117.18056", "userId": 71, "storyId": 86, "halflife": 6}, {"title": "Yesterdays home runs don't win today's games.", "body": "The only catch is that we get on average only about 5-7% of the upside, while an employer gets nearly all of it.  (We're counting on it being 5-7% of a much larger number.)As well as working hard, the groups all turned out to be extraordinarily responsible.", "latitude": "-12.27861", "longitude": "-1.26667", "userId": 17, "storyId": 42, "halflife": 17}, {"title": "You cannot be lonely if you like the person you're alone with.", "body": "Plunge in, by all means, but remember later to look at your    idea in the harsh light of morning and ask: is this something people will pay for?", "latitude": "47.94056", "longitude": "-71.30539", "userId": 399, "storyId": 26, "halflife": 5}, {"title": "You only lose what you cling to.", "body": "Parents know they've concealed the facts about sex, and many at some point sit their kids down and explain more.", "latitude": "-8.01125", "longitude": "6.10278", "userId": 59, "storyId": 8, "halflife": 24}, {"title": "Life isn't about finding yourself. Life is about creating yourself.", "body": "And the best paying jobs are most dangerous, because they require your full attention.The advantage of the two-job route is that it lets you jump over obstacles.", "latitude": "62.15975", "longitude": "-95.45522", "userId": 137, "storyId": 92, "halflife": 45}, {"title": "To accomplish great things, we must dream as well as act.", "body": "If they saw that, they'd want you to take more risks.The other reason parents may be mistaken is that, like generals, they're always fighting the last war.", "latitude": "39.12639", "longitude": "-2.76667", "userId": 42, "storyId": 85, "halflife": 66}, {"title": "We choose our destiny in the way we treat others.", "body": "[4]EverythingThomas Huxley said \"Try to learn something about everything and  everything about something.\"", "latitude": "9.92402", "longitude": "33.9968", "userId": 176, "storyId": 19, "halflife": 96}, {"title": "The cure for boredom is curiosity. There is no cure for curiosity.", "body": "Facebook was till recently across the street, till they too had to move because they needed more space.4.", "latitude": "14.70802", "longitude": "15.9", "userId": 241, "storyId": 51, "halflife": 93}, {"title": "Your attitude, not your aptitude, will determine your altitude.", "body": "But I don't know any technology companies that have done it.There is one thing companies can do short of structuring themselves as sponges:  they can stay small.", "latitude": "48.4296", "longitude": "100.59656", "userId": 8, "storyId": 76, "halflife": 99}, {"title": "Do one thing every day that scares you.", "body": "But really what motivates us is the completely amoral desire that would motivate any hacker who looked at some complex device and realized that with a tiny tweak he could make it run more efficiently.", "latitude": "56.03333", "longitude": "8.9451", "userId": 108, "storyId": 93, "halflife": 17}, {"title": "Take heed: you do not find what you do not seek.", "body": "Over the years, as we asked for more details, they were compelled to invent more, so the story grew quite elaborate.", "latitude": "27.2521", "longitude": "121.94139", "userId": 72, "storyId": 47, "halflife": 46}, {"title": "There are people who have money and people who are rich.", "body": "That is a different world, both culturally and economically, from the one publishers currently inhabit.People will pay for information they think they can make money from.", "latitude": "44.86878", "longitude": "-87.29363", "userId": 467, "storyId": 61, "halflife": 89}, {"title": "You cannot be lonely if you like the person you're alone with.", "body": "Different languages have different conventions for how much you should put on a line; in C a lot of lines have nothing on them but a delimiter or two.Another easy test is the number of characters in a  program, but this is not very good either; some languages (Perl, for example) just use shorter identifiers than others.I think a better measure of the size of a program would be the  number of elements, where an element is anything that would be a distinct node if you drew a tree representing the ", "latitude": "35.04563", "longitude": "-99.55833", "userId": 93, "storyId": 50, "halflife": 5}, {"title": "Who sows virtue reaps honour.", "body": "Henry Ford couldn't have made a fortune   building cars in a society in which most people were still subsistence farmers; he would have had neither workers nor customers.If you want to reduce economic inequality instead of just improving the overall standard of living, it's not enough just to raise up   the poor.", "latitude": "26.40526", "longitude": "-102.17405", "userId": 148, "storyId": 65, "halflife": 4}, {"title": "In all things of nature there is something of the marvellous.", "body": "The thought of all this stupendously inefficient software burning up cycles doing the same thing over and over seems kind of gross to me.", "latitude": "52.94357", "longitude": "127.43068", "userId": 77, "storyId": 87, "halflife": 68}, {"title": "The ladder of success is never crowded at the top.", "body": "So we've probably only discovered a fraction of what we eventually will.That's why I'm so optimistic about HN.", "latitude": "49.9711", "longitude": "7.50787", "userId": 422, "storyId": 10, "halflife": 50}, {"title": "It is impossible for a man to learn what he thinks he already knows.", "body": "The higher-level abstractions are built in a very transparent way out of lower-level abstractions, which you can get hold of if you want.Nothing is hidden from you that doesn't absolutely have to be.", "latitude": "26.85587", "longitude": "120.1889", "userId": 386, "storyId": 13, "halflife": 64}, {"title": "God has given you one face, and you make yourself another.", "body": "Any      immediate improvement in nerds' lives is probably going to have to come from the nerds themselves.Merely understanding the situation they're in should make it less  painful.", "latitude": "38.9", "longitude": "112.2795", "userId": 205, "storyId": 75, "halflife": 51}, {"title": "Take it easy \u0097 but take it.", "body": "If you're a promising startup but don't yet have significant growth, all the investors are your friends in words, but few are in actions.", "latitude": "22.44753", "longitude": "120.63572", "userId": 65, "storyId": 94, "halflife": 87}, {"title": "Once we accept our limits, we go beyond them.", "body": "To a lot of pro-union readers, the first paragraph sounds like the sort of thing a right-wing radio talk show host would say to stir up his followers.", "latitude": "47.94652", "longitude": "120.8194", "userId": 201, "storyId": 72, "halflife": 71}, {"title": "Action is the foundational key to all success.", "body": "Specifications change while a program is being written, and this is not only inevitable, but desirable.The word \"essay\" comes from the French verb \"essayer\", which means \"to try\".", "latitude": "27.89196", "longitude": "21.80278", "userId": 252, "storyId": 97, "halflife": 62}, {"title": "You don't drown by falling in water. You drown by staying there.", "body": "If you have a list of all the things you shouldn't do, you can turn that into a recipe for succeeding just by negating.", "latitude": "-34.28333", "longitude": "74.47442", "userId": 77, "storyId": 96, "halflife": 50}, {"title": "You are special, you are unique, you are the best!", "body": "(Unless their working day ends at the same time as mine, the meeting presumably interrupts theirs, but since they made the appointment it must be worth it to them.)", "latitude": "30.92574", "longitude": "73.21168", "userId": 128, "storyId": 97, "halflife": 79}, {"title": "He who obtains has little. He who scatters has much.", "body": "Plus if this works it will deprive all the programmers who take pleasure in making multithreaded apps of so much amusing complexity.", "latitude": "-21.87611", "longitude": "-81.68513", "userId": 28, "storyId": 78, "halflife": 74}, {"title": "An ounce of emotion is equal to a ton of facts.", "body": "He'd also just arrived from Canada, and had a strong Canadian accent and a mullet.The problem is compounded by the fact that hackers, despite their reputation for social obliviousness, sometimes put a good deal of effort into seeming smart.", "latitude": "54.94478", "longitude": "-74.82906", "userId": 84, "storyId": 82, "halflife": 71}, {"title": "To be tested is good. The challenged life may be the best therapist.", "body": "Why should there be any limit to the number who could be employed by small, fast-moving companies with ten each?", "latitude": "41.71253", "longitude": "5.93611", "userId": 235, "storyId": 81, "halflife": 94}, {"title": "Argue for your limitations, and sure enough they're yours.", "body": "Historically there have always been certain towns that were centers for certain industries, and if you weren't in one of them you were at a disadvantage.", "latitude": "40.65591", "longitude": "9.97567", "userId": 489, "storyId": 63, "halflife": 10}, {"title": "From small beginnings come great things.", "body": "In my earlier spam-filtering software, the user could set up a list of such words and mail containing them would automatically get past the filters.", "latitude": "26.61502", "longitude": "10.69736", "userId": 77, "storyId": 14, "halflife": 76}, {"title": "Silence is the true friend that never betrays.", "body": "When so much time goes in one end and so little achievement comes out the other, something has to give.", "latitude": "45.09678", "longitude": "4.31667", "userId": 178, "storyId": 70, "halflife": 98}, {"title": "Work out your own salvation. Do not depend on others.", "body": "Even if something was going to take two weeks to write (few projects took longer), I knew I could see the effect in the software as soon as it was done.If", "latitude": "18.25667", "longitude": "-74.981", "userId": 293, "storyId": 71, "halflife": 18}, {"title": "The world is always in movement.", "body": "I have never seen any of ITA's code, but according to one of their top hackers they use a lot of macros, and I am not surprised to hear it.Centripetal ForcesI'm not saying there is no cost to using uncommon   technologies.", "latitude": "55.40776", "longitude": "-76.13753", "userId": 70, "storyId": 30, "halflife": 24}, {"title": "When deeds speak, words are nothing.", "body": "If probs is a list of the fifteen individual probabilities, you calculate the  combined probability thus:  (let ((prod (apply #'* probs)))   (/ prod (+ prod (apply #'* (mapcar #'(lambda (x)                                           (- 1 x))                                      probs)))))  One question that arises in practice is what probability to assign to a word you've never seen, i.e.", "latitude": "40.30064", "longitude": "122.6382", "userId": 202, "storyId": 61, "halflife": 81}, {"title": "You can do it if you believe you can!", "body": "If you want to trick a pointy-haired boss into letting you write software in Lisp, you could try telling him it's XML.", "latitude": "49.23161", "longitude": "-92.6513", "userId": 68, "storyId": 91, "halflife": 40}, {"title": "The cautious seldom err.", "body": "It means these ideas are invisible to most people who try to think of startup ideas, because their subconscious filters them out.", "latitude": "29.79966", "longitude": "9.66969", "userId": 341, "storyId": 88, "halflife": 79}, {"title": "Better to have loved and lost, than to have never loved at all.", "body": "And yet both have the same answer:1/(1 - n)Whenever you're trading stock in your company for anything, whether it's money or an employee or a deal with another company, the test for whether to do it is the same.", "latitude": "48.19672", "longitude": "-5.16971", "userId": 74, "storyId": 84, "halflife": 46}, {"title": "You have to think anyway, so why not think big?", "body": "We constantly have to make decisions about things we don't understand, and more often than not we're wrong.And yet a lot is at stake.", "latitude": "40.84639", "longitude": "104.27857", "userId": 144, "storyId": 81, "halflife": 1}, {"title": "Three things cannot be long hidden: the sun, the moon, and the truth.", "body": "And mind you, this an example where things turned out well.When a startup does return to working on the product after a funding round finally closes, it's as if they were returning to work after a months-long illness.", "latitude": "37.43553", "longitude": "36.73468", "userId": 500, "storyId": 17, "halflife": 3}, {"title": "Every human being is the author of his own health or disease.", "body": "As you move earlier in the venture funding process, the ratio of help to money increases, because earlier stage companies have different needs.", "latitude": "30.38889", "longitude": "-71.97889", "userId": 236, "storyId": 93, "halflife": 22}, {"title": "Experience can only be gained by doing not by thinking or dreaming.", "body": "The paintings that were popular at the time were mostly the art equivalent of McMansions?big, pretentious, and fake.", "latitude": "42.95947", "longitude": "13.69223", "userId": 451, "storyId": 26, "halflife": 4}, {"title": "Kind words do not cost much. Yet they accomplish much.", "body": "People won't wait as long to act on new ideas, but also those ideas will increasingly be developed within startups rather than big companies.", "latitude": "44.76355", "longitude": "120.61049", "userId": 418, "storyId": 58, "halflife": 91}]