[{"title": "Skill to do comes of doing.", "body": "The VCs will have  to be dragged kicking and screaming down this road, but like many things people have to be dragged kicking and screaming toward, it may actually be good for them.Google is a sign of the way things are going.", "latitude": "-11.72917", "longitude": "14.1", "userId": 150, "storyId": 25, "halflife": 86}, {"title": "Without faith, nothing is possible. With it, nothing is impossible.", "body": "This applies not just to intelligence but to ability in general, and that's why so many people said character was more important in choosing cofounders.", "latitude": "34.61249", "longitude": "108.6876", "userId": 126, "storyId": 27, "halflife": 63}, {"title": "Nothing is a waste of time if you use the experience wisely.", "body": "But even correcting for this, startup deals fall through alarmingly often?far more often than, say, deals to buy real estate.", "latitude": "37.40425", "longitude": "-0.09956", "userId": 360, "storyId": 72, "halflife": 67}, {"title": "Don't let what you can't do stop you from doing what you can do.", "body": "It costs you a little more equity, but   being able to play the two firms off each other (as well as ask   one if the other is being out of line) is invaluable.", "latitude": "40.14827", "longitude": "107.87348", "userId": 441, "storyId": 89, "halflife": 26}, {"title": "The heart has its reasons which reason knows not of.", "body": "Trevor Blackwell wrote the image generator and the manager, which merchants used to retrieve orders, view statistics, and configure domain names etc.", "latitude": "40.71633", "longitude": "-96.62609", "userId": 357, "storyId": 53, "halflife": 13}, {"title": "The heart has eyes which the brain knows nothing of.", "body": "The first names that come to mind always tend to be people I know personally, but it seems lame to use them.", "latitude": "32.94124", "longitude": "28.57883", "userId": 149, "storyId": 6, "halflife": 90}, {"title": "Better than a thousand hollow words, is one word that brings peace.", "body": "There should be lots of library functions; anything that can be implicit should be; the syntax should be terse to a fault; even the names of things should be short.And it's not only programs that should be short.", "latitude": "30.28653", "longitude": "120.0248", "userId": 223, "storyId": 15, "halflife": 76}, {"title": "Rainbows apologize for angry skies.", "body": "And yet the Lisps we have today are still pretty much what they had at MIT in the mid-1980s, because that's the last time Lisp had a sufficiently large and demanding user base.Of course, hackers have to know about a language before they can use it.", "latitude": "37.28942", "longitude": "-9.05026", "userId": 407, "storyId": 88, "halflife": 18}, {"title": "Freedom is the right to live as we wish.", "body": "test is especially helpful in deciding between different kinds of academic work, because fields vary greatly in this respect.", "latitude": "15.60138", "longitude": "-79.57139", "userId": 68, "storyId": 53, "halflife": 47}, {"title": "Experience is simply the name we give our mistakes.", "body": "The view of history we got in elementary school was a crude hagiography, with at least one representative of each powerful group.The famous scientists I remember were Einstein, Marie Curie, and George Washington Carver.", "latitude": "53.8638", "longitude": "15.62863", "userId": 265, "storyId": 51, "halflife": 70}, {"title": "We can only learn to love by loving.", "body": "They seem to have a standard piece of casuistry for this situation: that the angels are no longer working to help the company, and so don't deserve to keep their stock.", "latitude": "41.92371", "longitude": "24.72859", "userId": 330, "storyId": 78, "halflife": 47}, {"title": "Nothing happens unless first we dream.", "body": "What kind of book do you read and feel sad that there's only half of it left, instead of being impressed that you're half way through?", "latitude": "-11.72917", "longitude": "19.62613", "userId": 52, "storyId": 49, "halflife": 94}, {"title": "Everyone smiles in the same language.", "body": "So just do what you'd do in any complex, unfamiliar situation: proceed deliberately, and question anything that seems odd.It is, unfortunately, common for VCs to put terms in an agreement whose consequences surprise founders later, and also common for VCs to defend things they do by saying that they're standard in the industry.", "latitude": "-33.19051", "longitude": "120.369", "userId": 491, "storyId": 41, "halflife": 72}, {"title": "Better be ignorant of a matter than half know it.", "body": "Then it's up to them to tell VCs early on.The reason you don't want to give them up is the following scenario.", "latitude": "44.66667", "longitude": "79.27663", "userId": 410, "storyId": 64, "halflife": 71}, {"title": "See the positive side, the potential, and make an effort.", "body": "You can't trust the opinions of the others, because of the Blub paradox: they're satisfied with whatever language they happen to use, because it dictates the way they think about programs.I know this from my own experience, as a high school kid writing programs in Basic.", "latitude": "15.33805", "longitude": "21.75694", "userId": 171, "storyId": 35, "halflife": 97}, {"title": "He who conquers others is strong; He who conquers himself is mighty.", "body": "I've heard of people hacking for    36 hours straight, but the most I've ever been able to manage    is about 18, and I work best in chunks of no more than 12.The optimum is not the limit you can physically endure.", "latitude": "47.64784", "longitude": "120.9822", "userId": 358, "storyId": 16, "halflife": 21}, {"title": "Knowing is not enough; we must apply!", "body": "After having been told for years that everyone just likes to do things their own way, he is unlikely to head straight for the conclusion that a great artist is someone whose work is better than the others'.", "latitude": "44.18972", "longitude": "-85.6586", "userId": 217, "storyId": 99, "halflife": 76}, {"title": "It isn't where you come from, it's where you're going that counts.", "body": "I never used Microsoft software, so it only affected me indirectly?for example, in the spam I got from botnets.", "latitude": "31.82089", "longitude": "7.54702", "userId": 418, "storyId": 73, "halflife": 32}, {"title": "Someone is special only if you tell them.", "body": "(If it strikes you as odd that people still order electronic parts out of thick paper catalogs in 2007, there's a reason for that.", "latitude": "48.16667", "longitude": "-69.33394", "userId": 200, "storyId": 16, "halflife": 66}, {"title": "If there is no struggle, there is no progress.", "body": "You already know where you're going, and you want to go straight there, blustering through obstacles, and hand-waving your way across swampy ground.", "latitude": "40.23373", "longitude": "21.96897", "userId": 43, "storyId": 16, "halflife": 48}, {"title": "The only real valuable thing is intuition.", "body": "When my father was working at Westinghouse in the 1970s, he had people working for him who made more than he did, because they'd been there longer.Now companies increasingly have to pay employees market price for the work they do.", "latitude": "46.69972", "longitude": "120.06347", "userId": 427, "storyId": 48, "halflife": 69}, {"title": "Yeah we all shine on, like the moon, and the stars, and the sun.", "body": "But more importantly, audiences are still learning how to be stolen?they're still just beginning to realize how much  deeper bloggers can dig than journalists, how much more interesting  a democratic news site can be than a front page controlled by editors, and how much funnier a bunch of kids with webcams can be than mass-produced sitcoms.The big media companies shouldn't worry that people will post their copyrighted material on YouTube.", "latitude": "46.68532", "longitude": "-2.34421", "userId": 306, "storyId": 100, "halflife": 46}, {"title": "The undertaking of a new action brings new strength.", "body": "Closer, probably,  than the men running our government, who for all their talk of patriotism remind me more of Richelieu or Mazarin than Thomas Jefferson or George Washington.When you read what the founding fathers had to say for themselves, they sound more like hackers.", "latitude": "39.71477", "longitude": "49.85", "userId": 62, "storyId": 37, "halflife": 11}, {"title": "Kindness is the golden chain by which society is bound together.", "body": "The problem is the same they face in operating systems: they can't pay people enough to build something better than a group of inspired hackers will build for free.I suspect professionalism was always overrated-- not just in the literal sense of working for money, but also connotations like formality and detachment.", "latitude": "-7.1893", "longitude": "7.88333", "userId": 227, "storyId": 89, "halflife": 35}, {"title": "I begin with an idea and then it becomes something else.", "body": "It's an old one, as old as forums, but we're still just learning what the causes are and how to address them.There are two senses of the word \"troll.\"", "latitude": "46.02085", "longitude": "115.46303", "userId": 155, "storyId": 78, "halflife": 26}, {"title": "Happiness depends upon ourselves.", "body": "[9]The other reason it's hard to start a company before 23 is that      people won't take you seriously.", "latitude": "-9.8605", "longitude": "124.2901", "userId": 364, "storyId": 6, "halflife": 88}, {"title": "The superior man is modest in his speech, but exceeds in his actions.", "body": "Letters, digits, dashes, apostrophes, and dollar signs are constituent characters, and everything else is a token separator.", "latitude": "22.70055", "longitude": "25.03333", "userId": 94, "storyId": 91, "halflife": 35}, {"title": "Better be ignorant of a matter than half know it.", "body": "October 2006(This essay is derived from a talk at MIT.)Till recently graduating seniors had two choices: get a job or go to grad school.", "latitude": "36.32959", "longitude": "8.32746", "userId": 48, "storyId": 52, "halflife": 60}, {"title": "Argue for your limitations, and sure enough theyre yours.", "body": "[1]A few years later I heard a talk by someone who was not merely a better speaker than me, but a famous speaker.", "latitude": "30.11405", "longitude": "-74.02799", "userId": 430, "storyId": 4, "halflife": 4}, {"title": "I believe that every person is born with talent.", "body": "The only way to do that is to try implementing them.Like most startups, we changed our plan on the fly.", "latitude": "-0.40306", "longitude": "105.9113", "userId": 387, "storyId": 60, "halflife": 5}, {"title": "Blaze with the fire that is never extinguished.", "body": "The revenue estimate is based on revenues of $1.35 billion for the first half of 2004, as reported in their IPO filing.Thanks to Chris Anderson, Trevor Blackwell, Sarah Harlin, Jessica Livingston, and Robert Morris for reading drafts of this.The Long TailRussian TranslationJapanese Translation", "latitude": "-8.2152", "longitude": "104.64846", "userId": 282, "storyId": 53, "halflife": 6}, {"title": "I never worry about action, but only inaction.", "body": "And so all over the country students are writing not about how a baseball team with a small budget might compete with the Yankees, or the role of color in fashion, or what constitutes a good dessert, but about symbolism in Dickens.With the result that writing is made to seem boring and pointless.", "latitude": "15.33805", "longitude": "106.05998", "userId": 258, "storyId": 42, "halflife": 92}, {"title": "He who fears being conquered is sure of defeat.", "body": "Sort of like slashing holes in your clothes or putting a safety pin through your ear, which were other forms of impressive impracticality then just coming into fashion.But", "latitude": "50.66384", "longitude": "23.9", "userId": 250, "storyId": 67, "halflife": 66}, {"title": "You are the only person on Earth who can use your ability.", "body": "Now the slowness of hiking seems an advantage, because the longer I spend on the trail, the longer I have to think without interruption.Sounds pretty eccentric, doesn't it?", "latitude": "40.62917", "longitude": "-4.64287", "userId": 300, "storyId": 22, "halflife": 92}, {"title": "The secret to a rich life is to have more beginnings than endings.", "body": "One of the most common emails we get is from people asking if we can help them set up a local clone of Y Combinator.", "latitude": "45.75324", "longitude": "25.7725", "userId": 290, "storyId": 52, "halflife": 88}, {"title": "Don't be pushed by your problems; be led by your dreams.", "body": "If that worked, any company could build products as good as Apple's just by hiring  sufficiently qualified designers.[6]", "latitude": "-6.4446", "longitude": "45.08361", "userId": 185, "storyId": 16, "halflife": 86}, {"title": "Study the past, if you would divine the future.", "body": "And yet it never occurred to me till recently to put those two ideas together and ask \"How can VCs make money by investing in stuff they don't understand?\"The", "latitude": "14.41667", "longitude": "112.3387", "userId": 491, "storyId": 80, "halflife": 70}, {"title": "To be upset over what you don't have is to waste what you do have.", "body": "It's not mystery meat cooked up out of scraps of pitch letters and press releases, and pressed into  molds of zippy journalese.", "latitude": "18.44667", "longitude": "16.6139", "userId": 90, "storyId": 87, "halflife": 82}, {"title": "The secret of success is constancy to purpose.", "body": "If a startup succeeds, you get millions of dollars, and you don't get that kind of money just by asking for it.", "latitude": "46.55", "longitude": "-66.99212", "userId": 56, "storyId": 38, "halflife": 7}, {"title": "He who talks more is sooner exhausted.", "body": "He is the least suburban-golf-playing VC I know.He likes to observe startups for a while before acting, so don't be bummed if he seems ambivalent.--pgfrom:", "latitude": "-34.78333", "longitude": "-91.14931", "userId": 97, "storyId": 65, "halflife": 51}, {"title": "Sooner or later, those who win are those who think they can.", "body": "It was presumably many thousands of years between when people first started describing things as hot or cold and when someone asked \"what is heat?\"", "latitude": "45.16719", "longitude": "0.38401", "userId": 360, "storyId": 89, "halflife": 45}, {"title": "The only real valuable thing is intuition.", "body": "That is one of the most distinctive differences between school and the real world: there is no reward for putting in a good effort.", "latitude": "13.56695", "longitude": "3.42834", "userId": 380, "storyId": 52, "halflife": 71}, {"title": "You won't skid if you stay in a rut.", "body": "\"They're not trying to impress anyone.\"Interestingly, while Kate said that she could never pick out successful founders, she could recognize VCs, both by the way they dressed and the way they carried themselves.", "latitude": "-28.62075", "longitude": "16.53395", "userId": 142, "storyId": 15, "halflife": 24}, {"title": "Those who are free of resentful thoughts surely find peace.", "body": "If there's something you're really interested in, you'll find they have an uncanny way of leading back to it anyway, just as the conversation of people who are especially proud of something always tends to lead back to it.For example, I've always been fascinated by comb-overs, especially the extreme sort that make a man look as if he's wearing a beret made of his own hair.", "latitude": "32.94124", "longitude": "135.50074", "userId": 141, "storyId": 49, "halflife": 67}, {"title": "Every day may not be good, but there's something good in every day.", "body": "No.Whether the number of founders in the same position is asymptotic or merely large, there are certainly a lot of them.", "latitude": "31.47293", "longitude": "100.32134", "userId": 479, "storyId": 35, "halflife": 58}, {"title": "You give before you get.", "body": "So the guys you end  up reading about in the papers are the ones who are very  smart, totally dedicated, and win the lottery.", "latitude": "42.70641", "longitude": "23.77651", "userId": 78, "storyId": 47, "halflife": 86}, {"title": "No one has ever become poor by giving.", "body": "But it means if you have this most common type of ambition, you'll probably have to figure out where to live by trial and error.", "latitude": "47.91055", "longitude": "8.87278", "userId": 392, "storyId": 19, "halflife": 97}, {"title": "Patience is the companion of wisdom.", "body": "For example, a language in which indentation is significant, like Python, would not work very well on printer terminals.", "latitude": "45.59416", "longitude": "-96.62609", "userId": 376, "storyId": 62, "halflife": 33}, {"title": "To avoid criticism, do nothing, say nothing, be nothing.", "body": "Mathematicians don't answer questions by working them out on paper the way schoolchildren are taught to.", "latitude": "-7.3102", "longitude": "-78.03333", "userId": 27, "storyId": 42, "halflife": 79}, {"title": "Every gift from a friend is a wish for your happiness.", "body": "If you can develop technology that's simply too hard for competitors to duplicate, you don't need to rely on other defenses.", "latitude": "48.44727", "longitude": "7.84523", "userId": 271, "storyId": 82, "halflife": 21}, {"title": "It is never too late to be what you might have been.", "body": "You could combine one of these chips with some memory (256 bytes in the first Altair), and front panel switches, and you'd have a working computer.", "latitude": "8.38944", "longitude": "10.26667", "userId": 487, "storyId": 6, "halflife": 22}, {"title": "The less effort, the faster and more powerful you will be.", "body": "But the non-gullible majority won't stop getting spam until they can stop (or threaten to stop) the gullible from responding to it.", "latitude": "46.4385", "longitude": "40.73", "userId": 125, "storyId": 98, "halflife": 5}, {"title": "The way is not in the sky. The way is in the heart.", "body": "At the other extreme you work at something till you make enough not to  have to work for money again.The two-job route is less common than the organic route, because it requires a deliberate choice.", "latitude": "-8.1041", "longitude": "35.98179", "userId": 421, "storyId": 82, "halflife": 98}, {"title": "Tension is who you think you should be. Relaxation is who you are.", "body": "Business schools like to talk about startups, but philosophically they're at the opposite end of the spectrum.", "latitude": "46.5695", "longitude": "2.81373", "userId": 358, "storyId": 27, "halflife": 94}, {"title": "I always wanted to be somebody, but I should have been more specific.", "body": "Determination implies your willfulness is balanced by discipline.That word balance is a significant one.", "latitude": "56.22602", "longitude": "120.85", "userId": 7, "storyId": 93, "halflife": 37}, {"title": "Self-complacency is fatal to progress.", "body": "If you have to introduce yourself, or someone else describes you, it will be as something like, John Smith, age 10, a student at such and such elementary school, or John Smith, age 20, a student at such and such college.When", "latitude": "42.52787", "longitude": "-0.03333", "userId": 13, "storyId": 9, "halflife": 54}, {"title": "Meaning is not what you start with but what you end up with.", "body": "I still wonder if this was a smart idea.)What makes the Bay Area superior is the attitude of the people.", "latitude": "44.58457", "longitude": "91.55424", "userId": 264, "storyId": 85, "halflife": 1}, {"title": "Happiness is found in doing, not merely possessing.", "body": "The books I bring on trips are often quite virtuous, the sort of stuff that might be assigned reading in a college class.", "latitude": "26.51167", "longitude": "10.64548", "userId": 55, "storyId": 15, "halflife": 55}, {"title": "Real magic in relationships means an absence of judgement of others.", "body": "The desire for them can cloud one's judgement?which is especially frightening when the judgement being clouded is the already wretched judgement of a teenage kid.Here parents' desires conflict.", "latitude": "45.11244", "longitude": "23.7257", "userId": 302, "storyId": 40, "halflife": 54}, {"title": "Great acts are made up of small deeds.", "body": "They felt under pressure to release their new OS, whose release date had already slipped four times, but some of the software (support for CDs and DVDs) wasn't ready.", "latitude": "65.84811", "longitude": "79.27663", "userId": 24, "storyId": 96, "halflife": 67}, {"title": "Science is organized knowledge. Wisdom is organized life.", "body": "Just pick a project that seems interesting: to master some chunk of material, or to make something, or to answer some question.", "latitude": "5.0469", "longitude": "11.76642", "userId": 232, "storyId": 50, "halflife": 100}, {"title": "Imagination rules the world.", "body": "Probably just thirty, if I could pick them,  would be enough to turn Buffalo into a significant startup hub.[2]", "latitude": "37.35024", "longitude": "20.85189", "userId": 469, "storyId": 99, "halflife": 7}, {"title": "Truth is powerful and it prevails.", "body": "Most programming probably consists of writing  little glue programs, and for  little glue programs you can use any language that you're already familiar with and that has good libraries for whatever you need to do.", "latitude": "44.71003", "longitude": "56.8204", "userId": 26, "storyId": 23, "halflife": 12}, {"title": "All serious daring starts from within.", "body": "If I remember correctly, the most popular kids don't persecute nerds; they don't need to stoop to such things.", "latitude": "39.35083", "longitude": "-2.27962", "userId": 196, "storyId": 80, "halflife": 6}, {"title": "The secret of success is constancy to purpose.", "body": "So \"Don't be evil\" may be the most valuable thing Paul Buchheit made for Google, because it may turn out to be an elixir of corporate youth.", "latitude": "26.33826", "longitude": "130.88814", "userId": 279, "storyId": 93, "halflife": 88}, {"title": "All know the way; few actually walk it.", "body": "If that was what character and integrity were, I wanted no part of them.The word I most misunderstood was \"tact.\"", "latitude": "39.3575", "longitude": "19.86694", "userId": 463, "storyId": 11, "halflife": 100}, {"title": "All things change; nothing perishes.", "body": "They're happy to invest in a company where the most likely outcome is a $20 million acquisition if they can do it at a low enough valuation.", "latitude": "37.89783", "longitude": "6.98807", "userId": 367, "storyId": 55, "halflife": 25}, {"title": "To avoid criticism, do nothing, say nothing, be nothing.", "body": "In these situations, the deal terms tend to be random: the angel asks his lawyer to create a vanilla agreement, and the terms end up being whatever the lawyer considers vanilla.", "latitude": "55.66667", "longitude": "-93.34212", "userId": 37, "storyId": 28, "halflife": 2}, {"title": "The ladder of success is never crowded at the top.", "body": "Because Python doesn't fully support lexical variables, you have to create a data structure to hold the value of n. And although Python does have a function data type, there is no literal representation for one (unless the body is only a single expression) so you need to create a named function to return.", "latitude": "28.85816", "longitude": "-2.2579", "userId": 397, "storyId": 75, "halflife": 24}, {"title": "Kind words do not cost much. Yet they accomplish much.", "body": "If you tag along on a friend's investments, you don't have to find startups.The problem is not finding startups, exactly, but finding a stream of reasonably high quality ones.", "latitude": "43.92686", "longitude": "120.70884", "userId": 400, "storyId": 23, "halflife": 99}, {"title": "Real magic in relationships means an absence of judgement of others.", "body": "In fact, it could be anything...The problem is, as you approach (in the calculus sense) a description of something that could be anything, the content of your description approaches zero.", "latitude": "43.07185", "longitude": "11.66379", "userId": 427, "storyId": 89, "halflife": 91}, {"title": "Yesterdays home runs don't win today's games.", "body": "If a round takes 2 months to close, which is reasonably fast by present standards, that means 2 months during which the company is basically treading water.", "latitude": "41.63333", "longitude": "0.33929", "userId": 414, "storyId": 6, "halflife": 8}, {"title": "Be your own hero, it's cheaper than a movie ticket.", "body": "I was annoyed recently to read a description of Y Combinator that said \"Y Combinator does seed funding for startups.\"", "latitude": "39.75181", "longitude": "6.82671", "userId": 343, "storyId": 69, "halflife": 46}, {"title": "It's not what happens to you, but how you react to it that matters.", "body": "Bill Gates would probably have ended up pretty rich even if IBM hadn't happened to drop the PC standard in his lap.I've thought a lot about the disagreement between the investors who prefer to bet on people and those who prefer to bet on markets.", "latitude": "48.89753", "longitude": "111.8268", "userId": 131, "storyId": 72, "halflife": 26}, {"title": "A really great talent finds its happiness in execution.", "body": "The startup may have more long-term potential, but you'll always interrupt working on it to answer calls from people paying you now.", "latitude": "40.75365", "longitude": "81.3615", "userId": 362, "storyId": 94, "halflife": 68}, {"title": "To be upset over what you don't have is to waste what you do have.", "body": "If you let your mind wander a few blocks down the street to the messy, tedious ideas, you'll find valuable ones just sitting there waiting to be implemented.The schlep filter is so dangerous that I wrote a separate essay about the condition it induces, which I called  schlep blindness.", "latitude": "45.21667", "longitude": "-2.07384", "userId": 92, "storyId": 43, "halflife": 11}, {"title": "Nobody can do everything, but everybody can do something.", "body": "Whereas a 25 year old has some work experience (more on that later) but can live as cheaply as an undergrad.Robert", "latitude": "40.0619", "longitude": "-80.68333", "userId": 391, "storyId": 35, "halflife": 99}, {"title": "To get the full value of joy you must have someone to divide it with.", "body": "This is more pronounced among the very top funds; the lamer ones still want to fund MBAs.If you're a hacker, it's good news that investors are looking for Larry and Sergey.", "latitude": "23.21872", "longitude": "15.02055", "userId": 143, "storyId": 38, "halflife": 85}, {"title": "Better than a thousand hollow words, is one word that brings peace.", "body": "So you'll be willing for example to hire another programmer, who won't contribute to this week's growth but perhaps in a month will have implemented some new feature that will get you more users.", "latitude": "40.22333", "longitude": "-55.93333", "userId": 432, "storyId": 35, "halflife": 85}, {"title": "The years teach much which the days never know.", "body": "The only bigger pain is not needing to, because your initial version was too big and rigid to evolve into something users wanted.I suspect this is another reason startups beat big companies.", "latitude": "49.13444", "longitude": "122.25688", "userId": 256, "storyId": 82, "halflife": 38}, {"title": "Study the past, if you would divine the future.", "body": "But programming languages are different: programming languages are not just technology, but what programmers think in.", "latitude": "41.73893", "longitude": "48.3043", "userId": 353, "storyId": 32, "halflife": 77}, {"title": "Do good by stealth, and blush to find it fame.", "body": "Kids in pre-industrial times started working at about 14 at the latest; kids on farms, where most people lived, began far   earlier.", "latitude": "49.95701", "longitude": "14.26854", "userId": 247, "storyId": 4, "halflife": 78}, {"title": "In the middle of every difficulty lies opportunity.", "body": "It's something they plunge into, working fast and constantly changing their minds, like a charcoal sketch.In software, paradoxical as it sounds, good craftsmanship means working fast.", "latitude": "55.63135", "longitude": "74.24467", "userId": 194, "storyId": 81, "halflife": 22}, {"title": "A good plan today is better than a perfect plan tomorrow.", "body": "Japanese are only about 2% of the world population, and Jews about .2%.)[5] According to the World Bank, the initial capital requirement for German companies is 47.6% of the per capita income.", "latitude": "44.26918", "longitude": "179.31667", "userId": 398, "storyId": 48, "halflife": 82}, {"title": "I may not know everything, but everything is not known yet anyway.", "body": "But so far the only companies smart enough to do this are companies smart enough not to need to.Thanks to Trevor Blackwell, Jessica Livingston, and Geoff Ralston for reading drafts of this.", "latitude": "-14.47278", "longitude": "100.02097", "userId": 208, "storyId": 58, "halflife": 30}, {"title": "Science is organized knowledge. Wisdom is organized life.", "body": "That's the main reason we do Y Combinator: to let loose all this energy by making it easy for hackers to start their own startups.A", "latitude": "31.12931", "longitude": "-79.57139", "userId": 277, "storyId": 42, "halflife": 7}, {"title": "He who knows himself is enlightened.", "body": "When you're too weak to lift something, you can tell, but when you're making a decision impetuously, you're all the more sure of it.", "latitude": "24.83833", "longitude": "-104.8294", "userId": 366, "storyId": 44, "halflife": 33}, {"title": "Freedom is what you do with what's been done to you.", "body": "It would be like mathematicians running Vogue-- or perhaps more accurately, Vogue editors running a math journal.", "latitude": "54.49111", "longitude": "20.85189", "userId": 119, "storyId": 58, "halflife": 42}, {"title": "Learn from yesterday, live for today, hope for tomorrow.", "body": "No one complains when a few people surpass all the rest at playing chess or writing novels, but when a few people make more money than the rest, we get editorials saying this is wrong.Why?", "latitude": "-42.75149", "longitude": "1.02395", "userId": 442, "storyId": 5, "halflife": 97}, {"title": "Patience is the companion of wisdom.", "body": "Runners can at least compare themselves to others doing exactly the same thing; if you win an Olympic gold medal, you can be fairly content, even if you think you could have run a bit faster.", "latitude": "14.8", "longitude": "105.8782", "userId": 20, "storyId": 78, "halflife": 97}, {"title": "All men who have achieved great things have been great dreamers.", "body": "There seem to be several categories of cuts: things I got wrong, things that seem like bragging, flames, digressions, stretches of awkward prose, and unnecessary words.I discarded more from the beginning.", "latitude": "51.95109", "longitude": "66.83799", "userId": 458, "storyId": 53, "halflife": 34}, {"title": "Strong beliefs win strong men, and then make them stronger.", "body": "In part because Steve Jobs got pushed out by John Sculley in a way that's rare among technology companies.", "latitude": "-7.4187", "longitude": "-70.15641", "userId": 192, "storyId": 82, "halflife": 35}, {"title": "Be sure you put your feet in the right place, then stand firm.", "body": "At any given time I know of at least 3 or 4 YC alumni who I believe will be big successes but who are running on vapor, financially, because investors don't yet get what they're doing.", "latitude": "40.04928", "longitude": "2.48376", "userId": 479, "storyId": 85, "halflife": 91}, {"title": "The heart has eyes which the brain knows nothing of.", "body": "April 2009Recently I realized I'd been holding two ideas in my head that would explode if combined.The first is that startups may represent a new economic phase, on the scale of the Industrial Revolution.", "latitude": "51.95109", "longitude": "120.77194", "userId": 248, "storyId": 70, "halflife": 56}, {"title": "A man is not old as long as he is seeking something.", "body": "When you make things in large volumes you tend to standardize everything that doesn't need to change.At", "latitude": "43.23784", "longitude": "-86.85697", "userId": 388, "storyId": 52, "halflife": 21}, {"title": "Don't be pushed by your problems; be led by your dreams.", "body": "And early adopters are forgiving when you improve your system, even if this causes some breakage.There are two ways new technology gets introduced: the organic growth method, and the big bang method.", "latitude": "18.02106", "longitude": "116.70292", "userId": 160, "storyId": 72, "halflife": 71}, {"title": "Freedom is not worth having if it does not connote freedom to err.", "body": "Now we think of the middle class as people who are neither rich nor poor, but originally they were a distinct group.", "latitude": "40.94931", "longitude": "21.41034", "userId": 472, "storyId": 96, "halflife": 31}, {"title": "Sadness flies away on the wings of time.", "body": "A popular programming language should be interactive, and start up fast.Another thing you want in a throwaway program is brevity.", "latitude": "44.68833", "longitude": "119.49296", "userId": 112, "storyId": 16, "halflife": 45}, {"title": "The beginning is always today.", "body": "Perhaps it's in the sweet spot midway between.As for it being impossible, I reply: here's the data; here's the theory; theory explains data 100%.", "latitude": "14.6042", "longitude": "4.56851", "userId": 419, "storyId": 45, "halflife": 27}, {"title": "Sooner or later, those who win are those who think they can.", "body": "What's really happening is that startup-controlled rounds are taking the place of investor-controlled rounds.This is an instance of a very important meta-trend, one that Y Combinator itself has been based on from the beginning: founders are becoming increasingly powerful relative to investors.", "latitude": "42.70641", "longitude": "-73.52075", "userId": 29, "storyId": 13, "halflife": 4}]