[{"title": "Dinner with Katy Perry", "body": "We ate Foo at Bar with Moe and Larry. Their Acme bread was great!", "zip": "10004", "latitude": 40.705076, "longitude": -74.00916, "halflife": 100}, {"title": "My JWT video on sale", "body": "And I have 2000 other videos on youtube. Also I write 500 tech blogs per day. And I do pull request at least 100 times a day. And no, I don't sleep.", "zip": "11040", "latitude": 40.7326609, "longitude": -73.6948277, "halflife": 100}, {"title": "I have advice for you", "body": "One - During an interview, don't freak out. Two - Keep your resume in one page. Three - Ask questions. Four - dress appropriately. [ ... post truncated because too long ... ] OK that's it. I'm done. I'll stop talking.", "zip": "07424", "latitude": 40.9151955, "longitude": -74.2028202, "halflife": 100}, {"title": "Free Pizza \\(^o^)/", "body": "I just got a job that pays $400k! I'm buying everyone pizza!", "zip": "07052", "latitude": 40.7920341, "longitude": -74.2980747, "halflife": 100}, {"title": "Can you imagine what I would do if I could do all I can?", "body": "It's to look for problems, preferably problems you have yourself.The very best startup ideas tend to have three things in common: they're something the founders themselves want, that they themselves can build, and that few others realize are worth doing.", "latitude": "44.52809", "longitude": "100.98662", "userId": 182, "storylineId": 87, "halflife": 93}, {"title": "We never live; we are always in the expectation of living.", "body": "Better stick to the standard cartoon version that the Civil War was about slavery; people would be confused otherwise; plus you can show a lot of strength and diversity.", "latitude": "-13.65556", "longitude": "-108.02507", "userId": 193, "storylineId": 89, "halflife": 38}, {"title": "Example has more followers than reason.", "body": "Actually we're the opposite: incubators exert more control than ordinary VCs, and we make a point of exerting less.", "latitude": "36.10803", "longitude": "115.52274", "userId": 241, "storylineId": 34, "halflife": 44}, {"title": "There is no way to prosperity, prosperity is the way.", "body": "It's the partners who decide, and they view things with a colder eye.Because VCs invest large amounts, the money comes with more restrictions.", "latitude": "48.25479", "longitude": "98.53674", "userId": 400, "storylineId": 25, "halflife": 58}, {"title": "A man is not old as long as he is seeking something.", "body": "But it seems more dangerous to put stuff in that you've never needed  because it's thought to be a good idea.Rees", "latitude": "18.78333", "longitude": "5.40791", "userId": 452, "storylineId": 73, "halflife": 95}, {"title": "What we achieve inwardly will change outer reality.", "body": "For example, a seed firm should be able to give advice about how to approach VCs, which VCs obviously don't need to do; whereas VCs should be able to give advice about how to hire an \"executive team,\" which is not an issue in the seed stage.In the earliest phases, a lot of the problems are technical, so seed firms should be able to help with technical as well as business problems.Seed firms and angel investors generally want to invest in the initial phases of a startup, then hand them off to VC ", "latitude": "29.51302", "longitude": "9.53333", "userId": 19, "storylineId": 89, "halflife": 4}, {"title": "People may doubt what you say, but they will believe what you do.", "body": "My advice is to err on the side of safety: when someone offers you a decent deal, just take it and get on with building the company.", "latitude": "25.88001", "longitude": "-103.41752", "userId": 184, "storylineId": 49, "halflife": 96}, {"title": "A prudent question is one half of wisdom.", "body": "Companies can be so specialized that this similarity is concealed, but it is not only manufacturing  companies that create wealth.", "latitude": "53.2625", "longitude": "124.87694", "userId": 178, "storylineId": 6, "halflife": 89}, {"title": "Minds are like parachutes. They only function when open.", "body": "Ultimately these will affect a lot more than what software you use.We may be able to get a fix on these underlying forces by triangulating from open source and blogging.", "latitude": "40.68282", "longitude": "-4.94036", "userId": 315, "storylineId": 29, "halflife": 94}, {"title": "No act of kindness, no matter how small, is ever wasted.", "body": "This one took  67 minutes?23 of writing, and  44 of rewriting.)I think it's far more important to write well than most people realize.", "latitude": "29.85326", "longitude": "-74.75043", "userId": 466, "storylineId": 63, "halflife": 71}, {"title": "Smile, breathe and go slowly.", "body": "Ten years ago VCs used to insist that founders step down as CEO and hand the job over to a business guy they supplied.", "latitude": "23.77861", "longitude": "8.41953", "userId": 266, "storylineId": 34, "halflife": 27}, {"title": "When the solution is simple, God is answering.", "body": "The great majority of programmers still go straight from college to cubicle, and stay there.It seems like people are not acting in their own interest.", "latitude": "-29.05531", "longitude": "-90.88944", "userId": 436, "storylineId": 46, "halflife": 2}, {"title": "Life is a learning experience, only if you learn.", "body": "In business, as in war, surprise is worth as much as force.And so, I'm a little embarrassed to say, I never said anything publicly about Lisp while we were working on Viaweb.", "latitude": "17.23028", "longitude": "10.36491", "userId": 177, "storylineId": 67, "halflife": 30}, {"title": "Self-complacency is fatal to progress.", "body": "Another great thing about Web-based software is that you get instant feedback from changes:  the number of people completing the test drive rose immediately from 60% to 90%.", "latitude": "50.18492", "longitude": "86.76794", "userId": 83, "storylineId": 80, "halflife": 18}, {"title": "Don't be afraid to go out on a limb. That's where the fruit is.", "body": "It would be pretty straightforward to make a list of the most eminent Silicon Valley angels and from that to generate a list of all the startups they'd invested in.", "latitude": "46.16278", "longitude": "120.21667", "userId": 35, "storylineId": 47, "halflife": 30}, {"title": "We choose our destiny in the way we treat others.", "body": "So although there may be, in certain specific moments (like your family, this month) a fixed amount of money available to trade with other people for things you want, there is not a fixed amount of wealth in the world.", "latitude": "45.03829", "longitude": "111.35908", "userId": 332, "storylineId": 41, "halflife": 17}, {"title": "If you wish to be a writer, write.", "body": "Thanks to Ingrid Basset, Trevor Blackwell, Sarah Harlin, Jessica  Livingston, Jackie McDonough, Robert Morris, and Aaron Swartz (who also found the PRSA article) for reading drafts of this.Correction: Earlier versions used a recent Business Week article mentioning del.icio.us as an example of a press hit, but Joshua Schachter tells me  it was spontaneous.The", "latitude": "-22.52667", "longitude": "-74.09709", "userId": 148, "storylineId": 68, "halflife": 46}, {"title": "In order to win, you must expect to win.", "body": "The  engineers build a reliable gadget with all kinds of new features; the industrial designers design a beautiful case for it; and then the marketing people convince everyone that it's something they've got to have.", "latitude": "45.39706", "longitude": "-101.21812", "userId": 278, "storylineId": 9, "halflife": 83}, {"title": "Be a good listener. Your ears will never get you in trouble.", "body": "Investment decisions are big decisions.That combination?making big decisions about things they don't understand?tends to make investors very skittish.", "latitude": "41.76588", "longitude": "-4.01696", "userId": 480, "storylineId": 42, "halflife": 77}, {"title": "An obstacle may be either a stepping stone or a stumbling block.", "body": "The other side may even break the deal; if they do that, they'll usually seize on some technicality or claim you misled them, rather than admitting they changed their minds.It can be hard to keep the pressure on an investor or acquirer all the way to the closing, because the most effective pressure is competition from other investors or acquirers, and these tend to drop away when you get a termsheet.", "latitude": "-30.63761", "longitude": "-98.17239", "userId": 120, "storylineId": 56, "halflife": 53}, {"title": "Myths which are believed in tend to become true.", "body": "We wasted little time on applets, but countless other startups must have been lured into this tar pit.", "latitude": "32.43575", "longitude": "20.26667", "userId": 137, "storylineId": 75, "halflife": 54}, {"title": "Do good by stealth, and blush to find it fame.", "body": "If you know you can love work, you're in the home stretch, and if you know what work you love, you're practically there.Notes[1]", "latitude": "37.96754", "longitude": "1.7", "userId": 379, "storylineId": 10, "halflife": 37}, {"title": "Whatever happens, take responsibility.", "body": "But the company may not be as corrupt as it seems; those VPs' cushy jobs were probably payment for work done earlier.I like the new model better.", "latitude": "44.78389", "longitude": "103.86105", "userId": 146, "storylineId": 9, "halflife": 18}, {"title": "The only real valuable thing is intuition.", "body": "It would be very convenient if you could assume that everyone would install your client-- so convenient that you could easily convince yourself that they all would-- but if they don't, you're hosed.", "latitude": "26.22452", "longitude": "4.47762", "userId": 54, "storylineId": 87, "halflife": 24}, {"title": "In order to win, you must expect to win.", "body": "Whatever their ideas were, they were ideas reasonable people could believe.So here is another source of interesting heresies.", "latitude": "41.39001", "longitude": "-5.50234", "userId": 423, "storylineId": 58, "halflife": 77}, {"title": "Silence is the true friend that never betrays.", "body": "Though I don't think it has much to offer good programmers, except in certain specialized domains, it is irresistible to    large organizations.", "latitude": "54.62372", "longitude": "10.35193", "userId": 6, "storylineId": 70, "halflife": 12}, {"title": "We make our own fortunes and we call them fate.", "body": "Merchants bid a percentage of sales for traffic, but the results were sorted not by the bid but by the bid times the average amount a user would buy.", "latitude": "50.71104", "longitude": "145.1342", "userId": 102, "storylineId": 60, "halflife": 33}, {"title": "Light tomorrow with today!", "body": "This was an era when small firms making everything from cars to candy were getting consolidated into a new kind of corporation with national reach and huge economies of scale.", "latitude": "25.10972", "longitude": "86.76794", "userId": 488, "storylineId": 34, "halflife": 20}, {"title": "The truest wisdom is a resolute determination.", "body": "That's because the test for what gets included in shows is basically the market price, and for recent art that is largely determined by successful businessmen and their wives.", "latitude": "55.7", "longitude": "34.64987", "userId": 282, "storylineId": 89, "halflife": 69}, {"title": "You have to think anyway, so why not think big?", "body": "Hackers write cool software, and then write a paper about it, and the paper becomes a proxy for the achievement represented by the software.", "latitude": "44.94803", "longitude": "120.44141", "userId": 212, "storylineId": 44, "halflife": 41}, {"title": "The doors we open and close each day decide the lives we live.", "body": "I'm going to start with what goes wrong and try to trace it back to the root causes.What goes wrong with young founders is that they build stuff that looks like class projects.", "latitude": "18.75028", "longitude": "10.88342", "userId": 87, "storylineId": 46, "halflife": 46}, {"title": "We choose our destiny in the way we treat others.", "body": "They do more in their heads: they try to understand a problem space well enough that they can walk around it the way you can walk around the memory of the house you grew up in.", "latitude": "42.04177", "longitude": "112.86135", "userId": 249, "storylineId": 10, "halflife": 92}, {"title": "The heart has its reasons which reason knows not of.", "body": "They may not care; they may prefer to work with an investor they already know; but as the investment market becomes more efficient, it will become increasingly easy to get market price if they want it.", "latitude": "14.16667", "longitude": "4.27639", "userId": 416, "storylineId": 82, "halflife": 15}, {"title": "Just as much as we see in others we have in ourselves.", "body": "Odds are people in 100 years will be as shocked at some of the lies we tell as we are at some of the lies people told 100 years ago.I can't predict which these will be, and I don't want to write an essay that will seem dumb in 100 years.", "latitude": "15.77772", "longitude": "4.77575", "userId": 348, "storylineId": 6, "halflife": 45}, {"title": "Victory belongs to the most persevering.", "body": "All you have to do is not work too hard at fixing bugs?which, if you're a big company, you produce in copious quantities.", "latitude": "52.55705", "longitude": "49.7086", "userId": 314, "storylineId": 88, "halflife": 52}, {"title": "You are special, you are unique, you are the best!", "body": "But needing to get a high price decreases the chance of getting bought at all; many companies can buy you for $10 million, but only a handful for 100.", "latitude": "41.19537", "longitude": "-0.43976", "userId": 70, "storylineId": 78, "halflife": 10}, {"title": "Action is the foundational key to all success.", "body": "[1]The reason so many people think of property as having a single unchanging definition is that its definition changes very slowly.", "latitude": "38.19229", "longitude": "22.93806", "userId": 257, "storylineId": 40, "halflife": 73}, {"title": "Sooner or later, those who win are those who think they can.", "body": "It begins with the three most important things to remember about divorce, one of which is:    You shouldn't put the blame on one parent, because divorce is   never only one person's fault.", "latitude": "46.73127", "longitude": "144.75225", "userId": 456, "storylineId": 16, "halflife": 38}, {"title": "From wonder into wonder existence opens.", "body": "You can either dig a hole that's broad but shallow, or one that's narrow and deep, like a well.Made-up startup ideas are usually of the first type.", "latitude": "46.96612", "longitude": "100.17036", "userId": 182, "storylineId": 81, "halflife": 55}, {"title": "A good decision is based on knowledge and not on numbers.", "body": "It also means no one university will be good enough to act as a mecca, attracting talent from abroad and causing startups to form around it.The case of Germany is a strange one.", "latitude": "40.92997", "longitude": "-78.46861", "userId": 33, "storylineId": 70, "halflife": 40}, {"title": "They can do all because they think they can.", "body": "[7]If you want to learn what people want, read Dale Carnegie's How to Win Friends and Influence People.", "latitude": "39.20674", "longitude": "4.67075", "userId": 237, "storylineId": 76, "halflife": 2}, {"title": "Every human being is the author of his own health or disease.", "body": "The customer support people were about thirty feet away from the programmers, and knew that they could always interrupt anything with a report of a genuine bug.", "latitude": "22.93672", "longitude": "5.49563", "userId": 52, "storylineId": 22, "halflife": 20}, {"title": "To get the full value of joy you must have someone to divide it with.", "body": "They'd rather lose the deal than establish a precedent of VCs competitively bidding against one another.", "latitude": "25.36525", "longitude": "-61.34441", "userId": 306, "storylineId": 47, "halflife": 54}, {"title": "Nothing will work unless you do.", "body": "There is a name now for what we were: an Application Service Provider, or ASP.I think that a lot of the next generation of software will be written on this model.", "latitude": "41.19537", "longitude": "-97.3244", "userId": 12, "storylineId": 8, "halflife": 20}, {"title": "Someone is special only if you tell them.", "body": "The programmers become system administrators, but without the sharply defined limits that ordinarily make the job bearable.At", "latitude": "38.03641", "longitude": "6.7", "userId": 45, "storylineId": 76, "halflife": 43}, {"title": "The best way to pay for a lovely moment is to enjoy it.", "body": "[6]If Microsoft used this approach, their software wouldn't be so full of security holes, because the less smart people writing the actual applications wouldn't be doing low-level stuff like allocating memory.", "latitude": "30.83095", "longitude": "-94.97855", "userId": 474, "storylineId": 63, "halflife": 52}, {"title": "In order to win, you must expect to win.", "body": "At Viaweb they were initially individuals and smaller companies, and I think this will be the rule with Web-based applications.", "latitude": "42.65565", "longitude": "12.03274", "userId": 362, "storylineId": 42, "halflife": 62}, {"title": "There are no failures. Just experiences and your reactions to them.", "body": "I suspect the pin will be wielded by a couple of 20 year old hackers who are too naive to be intimidated by the idea.", "latitude": "49.03464", "longitude": "41.51885", "userId": 50, "storylineId": 63, "halflife": 86}, {"title": "We choose our destiny in the way we treat others.", "body": "You'll see a lot more ideas, most of them bad, so you need to be able to filter them.One of the biggest dangers of not using the organic method is the example of the organic method.", "latitude": "34.13333", "longitude": "13.08051", "userId": 319, "storylineId": 21, "halflife": 40}, {"title": "Things do not change, we change.", "body": "In fact, the acquirer would have been better off; not only wouldn't these guys have broken anything, they'd have gotten a lot more done.", "latitude": "43.07669", "longitude": "-66.29795", "userId": 279, "storylineId": 77, "halflife": 22}, {"title": "Self-complacency is fatal to progress.", "body": "Instead of busting my ass in a startup, I     would have tried to get a nice, low-stress job at a big research  lab, or tenure at a university.That's what everyone does in societies where risk isn't rewarded.", "latitude": "40.62558", "longitude": "-105.1686", "userId": 186, "storylineId": 67, "halflife": 55}, {"title": "If you cannot be silent be brilliant and thoughtful.", "body": "Or rather, expertise in implementation is the only kind most people, including the experts themselves, can measure.", "latitude": "32.91018", "longitude": "9.11814", "userId": 447, "storylineId": 13, "halflife": 91}, {"title": "The foot feels the foot when it feels the ground.", "body": "In such a close game, the smallest increase in the forces against you can be enough to flick you over the edge into failure.When we first started Y Combinator  we encouraged people to start startups while they were still in college.", "latitude": "25.05697", "longitude": "8.74105", "userId": 231, "storylineId": 27, "halflife": 43}, {"title": "Society develops wit, but its contemplation alone forms genius.", "body": "But a programmer deciding between a regular job at a big company and their own startup is probably going to learn more doing the startup.You can adjust the amount of freedom you get by scaling the size of company you work for.", "latitude": "37.3535", "longitude": "22.27388", "userId": 36, "storylineId": 48, "halflife": 59}, {"title": "We do what we do because we believe.", "body": "Perhaps it's because startups are less of a zero sum game than most types of business; they are rarely killed by competitors.", "latitude": "-37.54415", "longitude": "-59.02689", "userId": 252, "storylineId": 100, "halflife": 77}, {"title": "Every problem has a gift for you in its hands.", "body": "You should make your system better at least in some small way every day or two.This is not just a good way to get development done; it is also a form of marketing.", "latitude": "50.1", "longitude": "-105.52167", "userId": 358, "storylineId": 82, "halflife": 26}, {"title": "Real magic in relationships means an absence of judgement of others.", "body": "But only if (a) the distraction of hiring someone won't make you miss your numbers in the short term, and (b) you're sufficiently worried about whether you can keep hitting your numbers without hiring someone new.It's not that you don't think about the future, just that you think about it no more than necessary.In theory this sort of hill-climbing could get a startup into trouble.", "latitude": "40.2994", "longitude": "14.85528", "userId": 189, "storylineId": 86, "halflife": 97}, {"title": "Wherever a man turns he can find someone who needs him.", "body": "Algorithms that use it are called ``naive Bayesian.''The second assumption I made because the proportion of spam in my incoming mail fluctuated so much from day to day (indeed, from hour to hour) that the overall prior ratio seemed worthless as a predictor.", "latitude": "60.52556", "longitude": "14.93897", "userId": 170, "storylineId": 56, "halflife": 15}, {"title": "The best way to pay for a lovely moment is to enjoy it.", "body": "Perhaps more importantly, you'll get into the habit of doing things well.Another test you can use is: always produce.", "latitude": "30.58217", "longitude": "9.27677", "userId": 229, "storylineId": 59, "halflife": 5}, {"title": "Nobody will believe in you unless you believe in yourself.", "body": "Actually I suppose Apple has a third misconception: that all the complaints about App Store approvals are not a serious problem.", "latitude": "47.89402", "longitude": "120.63913", "userId": 105, "storylineId": 63, "halflife": 10}, {"title": "Just as much as we see in others we have in ourselves.", "body": "What's different about your brain after you have \"experience,\" and can you make that change happen faster?I", "latitude": "44.95997", "longitude": "73.80898", "userId": 418, "storylineId": 68, "halflife": 55}, {"title": "Nothing diminishes anxiety faster than action.", "body": "This one squeaked by with a probability of .88, just under the threshold of .9.Of course, looking at multiple token sequences would catch it easily.", "latitude": "39.45734", "longitude": "38.60174", "userId": 411, "storylineId": 99, "halflife": 34}, {"title": "All things change; nothing perishes.", "body": "The people you can say heretical things to without getting jumped on are also the most interesting to know.Viso", "latitude": "16.37", "longitude": "-16.41016", "userId": 430, "storylineId": 46, "halflife": 19}, {"title": "I may not know everything, but everything is not known yet anyway.", "body": "Likewise, if your professors try to make you learn stuff that's more advanced than you'll need in a job, it may not just be because they're academics, detached from the real world.", "latitude": "40.97621", "longitude": "-90.06095", "userId": 208, "storylineId": 41, "halflife": 53}, {"title": "I always wanted to be somebody, but I should have been more specific.", "body": "Otherwise as soon as some big company becomes aware of it, they'll make their own, and with their brand name, capital, and distribution clout, they'll take away your market overnight.", "latitude": "27.13181", "longitude": "-112.00988", "userId": 185, "storylineId": 67, "halflife": 47}, {"title": "Who sows virtue reaps honour.", "body": "And of course finding words this way that weren't visible in the original text would in itself be evidence of spam.Picking out the words won't be trivial.", "latitude": "47.25", "longitude": "7.99373", "userId": 99, "storylineId": 54, "halflife": 88}, {"title": "Fame usually comes to those who are thinking about something else.", "body": "If you're an amateur mathematician and think you've solved a famous open problem, better go back and check.", "latitude": "48.1729", "longitude": "-2.04653", "userId": 180, "storylineId": 23, "halflife": 95}, {"title": "Mountains cannot be surmounted except by winding paths.", "body": "After all, the companies selling smells on the moon base could continue to sell them on the Earth, if they lobbied successfully for laws requiring us all to continue to breathe through tubes down here too, even though we no longer needed to.The crazy legal measures that the labels and studios have been taking have a lot of that flavor.", "latitude": "50.66057", "longitude": "-97.85049", "userId": 420, "storylineId": 12, "halflife": 20}, {"title": "Know, first, who you are, and then adorn yourself accordingly.", "body": "I was forced to discard my protective incompetence, I found that business was neither so hard nor so boring as I feared.", "latitude": "44.79262", "longitude": "14.27133", "userId": 494, "storylineId": 19, "halflife": 57}, {"title": "Doing nothing is better than being busy doing nothing.", "body": "In software, an intractable problem can usually be replaced by an equivalent one that's easy to solve.", "latitude": "32.97944", "longitude": "22.44417", "userId": 355, "storylineId": 44, "halflife": 27}, {"title": "If you want a thing done well, do it yourself.", "body": "(He now runs a hedge fund, a not unrelated enterprise.)It is sometimes hard to explain to authorities why one would want to do such things.", "latitude": "50.63333", "longitude": "-13.86749", "userId": 387, "storylineId": 38, "halflife": 71}, {"title": "The day is already blessed, find peace within it.", "body": "For architects and designers it means that beauty should depend on a few carefully chosen structural elements rather than a profusion of superficial ornament.", "latitude": "48.12465", "longitude": "5.40791", "userId": 249, "storylineId": 44, "halflife": 86}, {"title": "I'm not afraid of storms, for Im learning how to sail my ship.", "body": "On the other, it seems unlikely that people in 100 years will still be living in the same email hell we do now.", "latitude": "28.88857", "longitude": "-97.40642", "userId": 471, "storylineId": 17, "halflife": 97}, {"title": "In all chaos there is a cosmos, in all disorder a secret order.", "body": "It would cost something to run, and it would be a pain to fund with grants and donations.That was a surprising realization.", "latitude": "44.99819", "longitude": "-2.23843", "userId": 394, "storylineId": 20, "halflife": 12}, {"title": "Life isn't about finding yourself. Life is about creating yourself.", "body": "People could have been publishing online in     1995, and yet blogging has only really taken off in the last couple years.", "latitude": "53.8195", "longitude": "-2.99309", "userId": 473, "storylineId": 84, "halflife": 57}, {"title": "One today is worth two tomorrows.", "body": "And then at the other extreme you have the hackers, who are trying to write interesting software, and for whom computers are just a medium of expression, as concrete is for architects or paint for painters.", "latitude": "52.13802", "longitude": "86.76794", "userId": 342, "storylineId": 90, "halflife": 89}, {"title": "Chaos and Order are not enemies, only opposites.", "body": "The only way to do that is to try implementing them.Like most startups, we changed our plan on the fly.", "latitude": "56.37238", "longitude": "12.61557", "userId": 280, "storylineId": 49, "halflife": 51}, {"title": "Silence is a true friend who never betrays.", "body": "But that, I now believe, is like a runner asking \"If I'm such a good athlete, why do I feel so tired?\"", "latitude": "47.47356", "longitude": "-2.3", "userId": 142, "storylineId": 66, "halflife": 61}, {"title": "If one does not know to which port is sailing, no wind is favorable.", "body": "And it is a very rare product that can't be made dramatically cheaper if you try.This was Henry Ford's plan.", "latitude": "35.50064", "longitude": "77.01729", "userId": 154, "storylineId": 25, "halflife": 93}, {"title": "Why worry about tomorrow, when today is all we have?", "body": "I didn't think of that idea, just its name.You might come up with something useful this way, but I never have.", "latitude": "51.02574", "longitude": "-6.36667", "userId": 216, "storylineId": 55, "halflife": 49}, {"title": "A short saying oft contains much wisdom.", "body": "Just make stuff and put it online.InappropriateIf you really want to score big, the place to focus is the margin of the margin: the territories only recently captured from the insiders.", "latitude": "37.50278", "longitude": "8.27278", "userId": 297, "storylineId": 24, "halflife": 67}, {"title": "Fame usually comes to those who are thinking about something else.", "body": "As a young founder your strengths are: stamina, poverty, rootlessness, colleagues, and ignorance.The importance of stamina shouldn't be surprising.", "latitude": "45.44209", "longitude": "-85.03244", "userId": 260, "storylineId": 48, "halflife": 93}, {"title": "If you do not change direction, you may end up where you are heading.", "body": "So if auto-retrieving filters became widespread, they'd become auto-unsubscribing filters.In this scenario, spam would, like OS crashes, viruses, and popups, become one of those plagues that only afflict people who don't bother to use the right software.", "latitude": "40.62842", "longitude": "-65.38692", "userId": 161, "storylineId": 56, "halflife": 9}, {"title": "Don't think of it as failure. Think of it as time-released success.", "body": "You can't see the fingerprints of PR firms all over the articles, as you can in so many print publications-- which is one of the reasons, though they may not consciously realize it, that readers trust bloggers more than Business Week.I was talking recently to a friend who works for a big newspaper.", "latitude": "50.16019", "longitude": "23.87505", "userId": 332, "storylineId": 18, "halflife": 98}, {"title": "Fortune favours the brave.", "body": "The question to ask about what you've built is not whether it's good, but whether it's good enough to supply the activation energy required.[5]", "latitude": "60.6987", "longitude": "6.09306", "userId": 444, "storylineId": 11, "halflife": 35}, {"title": "Meaning is not what you start with but what you end up with.", "body": "When governments decide how to allocate resources, political deal-making causes things to be spread out geographically.", "latitude": "15.36667", "longitude": "-92.47778", "userId": 178, "storylineId": 91, "halflife": 44}, {"title": "If you light a lamp for somebody, it will also brighten your path.", "body": "You have to build a shield around it, or it will fry you.The shielding of a reactor is not uniform; the reactor would be useless if it were.", "latitude": "25.93182", "longitude": "-1.41115", "userId": 385, "storylineId": 55, "halflife": 48}, {"title": "Yeah we all shine on, like the moon, and the stars, and the sun.", "body": "But I was never able to figure out exactly what happened inside the motel?exactly what was killing all the potential startups.", "latitude": "38.38339", "longitude": "132.63176", "userId": 147, "storylineId": 59, "halflife": 88}, {"title": "He who fears being conquered is sure of defeat.", "body": "Jobs and Wozniak couldn't have come up with that kind of money in a company financed by selling a VW bus and an HP calculator.", "latitude": "13.10073", "longitude": "-98.22167", "userId": 419, "storylineId": 67, "halflife": 20}, {"title": "I hear and I forget. I see and I remember. I do and I understand.", "body": "If I were talking to a guy four feet tall whose ambition  was to play in the NBA, I'd feel pretty stupid saying, you can do anything if you really try.", "latitude": "25.10972", "longitude": "-3.81898", "userId": 470, "storylineId": 15, "halflife": 3}, {"title": "I hear and I forget. I see and I remember. I do and I understand.", "body": "But since I've been dealing with VCs more I've learned that some suits are smarter than others.They're also in a business where winners tend to keep winning and losers to keep losing.", "latitude": "20.09833", "longitude": "23.35", "userId": 294, "storylineId": 88, "halflife": 70}, {"title": "You are the only person on earth who can use your ability.", "body": "experience of the SFP suggests that if you let motivated people do real work, they work hard, whatever their age.", "latitude": "46.1", "longitude": "-90.64417", "userId": 167, "storylineId": 37, "halflife": 66}, {"title": "No act of kindness, no matter how small, is ever wasted.", "body": "But here's a related suggestion that goes with the grain instead of against it: that universities establish a writing major.", "latitude": "52.0714", "longitude": "24.94677", "userId": 442, "storylineId": 65, "halflife": 78}, {"title": "Do something wonderful, people may imitate it.", "body": "You have to find a \"smoking gun,\" a passage in whatever you disagree with that you feel is mistaken, and then explain why it's mistaken.", "latitude": "52.99164", "longitude": "9.02355", "userId": 482, "storylineId": 66, "halflife": 80}, {"title": "Music in the soul can be heard by the universe.", "body": "The customer is always right, but different customers are right about different things; the least sophisticated users show you what you need to simplify and clarify, and the most sophisticated tell you what features you need to add.", "latitude": "40.75695", "longitude": "-97.05972", "userId": 453, "storylineId": 28, "halflife": 77}, {"title": "We never live; we are always in the expectation of living.", "body": "Just like the committee approving software purchases.And just as the greatest danger of being hard to sell to is not that you overpay but that the best suppliers won't even sell to you, the greatest danger of applying too many checks to your programmers is not that you'll make them unproductive, but that good programmers won't even want to work for you.Steve Jobs's famous maxim \"artists ship\" works both ways.", "latitude": "38.90088", "longitude": "8.57011", "userId": 94, "storylineId": 97, "halflife": 61}, {"title": "To want to be what one can be is purpose in life.", "body": "And the expertise and connections the  founders gained from running Kazaa helped ensure the success of Skype.Thanks to Patrick Collison, Jessica Livingston, and Fred Wilson for reading drafts of this.", "latitude": "51.55136", "longitude": "1.95", "userId": 418, "storylineId": 34, "halflife": 8}, {"title": "To want to be what one can be is purpose in life.", "body": "People may still watch things they call \"TV shows,\" but they'll watch them mostly on computers.What decided the contest for computers?", "latitude": "40.19475", "longitude": "14.58116", "userId": 225, "storylineId": 97, "halflife": 87}, {"title": "A man is not where he lives but where he loves.", "body": "That's why we're doing it during the summer-- so even college students can participate.We know from Google and Yahoo that grad students can start successful startups.", "latitude": "53.88333", "longitude": "118.37426", "userId": 21, "storylineId": 100, "halflife": 13}, {"title": "Write your plans in pencil and give God the eraser.", "body": "Lawrence, Family and Fortune: Studies in Aristocratic Finance in the Sixteenth and Seventeenth Centuries, Oxford University Press, 1973, p.", "latitude": "25.47496", "longitude": "120.63913", "userId": 199, "storylineId": 32, "halflife": 81}, {"title": "If the shoe doesn't fit, must we change the foot?", "body": "The reason character is so important is that it's tested more severely than in most other situations.", "latitude": "40.62667", "longitude": "118.03327", "userId": 483, "storylineId": 72, "halflife": 67}]