[{"title": "Dinner with Katy Perry", "body": "We ate Foo at Bar with Moe and Larry. Their Acme bread was great!", "zip": "10004", "latitude": 40.705076, "longitude": -74.00916, "halflife": 100}, {"title": "My JWT video on sale", "body": "And I have 2000 other videos on youtube. Also I write 500 tech blogs per day. And I do pull request at least 100 times a day. And no, I don't sleep.", "zip": "11040", "latitude": 40.7326609, "longitude": -73.6948277, "halflife": 100}, {"title": "I have advice for you", "body": "One - During an interview, don't freak out. Two - Keep your resume in one page. Three - Ask questions. Four - dress appropriately. [ ... post truncated because too long ... ] OK that's it. I'm done. I'll stop talking.", "zip": "07424", "latitude": 40.9151955, "longitude": -74.2028202, "halflife": 100}, {"title": "Free Pizza \\(^o^)/", "body": "I just got a job that pays $400k! I'm buying everyone pizza!", "zip": "07052", "latitude": 40.7920341, "longitude": -74.2980747, "halflife": 100}, {"title": "Thought is the blossom; language the bud; action the fruit behind it.", "body": "It's to look for problems, preferably problems you have yourself.The very best startup ideas tend to have three things in common: they're something the founders themselves want, that they themselves can build, and that few others realize are worth doing.", "latitude": "34.06048", "longitude": "3.00201", "userId": 496, "storylineId": 15, "halflife": 74}, {"title": "Where all think alike, no one thinks very much.", "body": "September 2010The reason startups have been using  more convertible notes in angel rounds is that they make deals close faster.", "latitude": "53.55024", "longitude": "113.67748", "userId": 266, "storylineId": 42, "halflife": 19}, {"title": "He who obtains has little. He who scatters has much.", "body": "language has a small core, and powerful, highly orthogonal libraries that are as carefully designed as the core language.", "latitude": "28.47585", "longitude": "14.55532", "userId": 174, "storylineId": 48, "halflife": 60}, {"title": "Chaos is inherent in all compounded things. Strive on with diligence.", "body": "The reason I didn't take money from my parents was that I didn't want them to lose it.ConsultingAnother way to fund a startup is to get a job.", "latitude": "45.17592", "longitude": "-80.6095", "userId": 217, "storylineId": 16, "halflife": 90}, {"title": "Why worry about tomorrow, when today is all we have?", "body": "And when a wolf appears, is he going to eat a sheep in the middle of the flock, or one near the edge?[5]", "latitude": "40.48249", "longitude": "88.41859", "userId": 123, "storylineId": 7, "halflife": 48}, {"title": "Most powerful is he who has himself in his own power.", "body": "By 1969, when Ted Kennedy drove   off the bridge at Chappaquiddick, the limit seemed to be down to   one.", "latitude": "60.80487", "longitude": "-85.99414", "userId": 461, "storylineId": 23, "halflife": 68}, {"title": "The shortest answer is doing.", "body": "Even if you could, I don't think you'd want to; someone who really, truly doesn't care what his peers think of him is probably a psychopath.", "latitude": "-32.02696", "longitude": "139.28333", "userId": 322, "storylineId": 91, "halflife": 86}, {"title": "The price of greatness is responsibility.", "body": "The reason those stimuli caused those founders to start companies was that their experiences had prepared them to notice the opportunities they represented.The verb you want to be using with respect to startup ideas is not \"think up\" but \"notice.\"", "latitude": "29.6015", "longitude": "12.87486", "userId": 415, "storylineId": 28, "halflife": 76}, {"title": "He who angers you conquers you.", "body": "December 2008A few months ago I read a New York Times article on South Korean cram schools that said    Admission to the right university can make or break an ambitious   young South Korean.", "latitude": "50.01667", "longitude": "10.57323", "userId": 89, "storylineId": 78, "halflife": 88}, {"title": "All is flux; nothing stays still.", "body": "Actors don't face that temptation except in the rare cases where they've written the script, but any speaker does.", "latitude": "41.07534", "longitude": "5.89693", "userId": 323, "storylineId": 73, "halflife": 44}, {"title": "Happiness is found in doing, not merely possessing.", "body": "But so many of the best hackers work on open-source projects now that the main effect of this policy may be to ensure that they won't be able to hire any first-rate programmers.[3]", "latitude": "-10.73333", "longitude": "115.44618", "userId": 24, "storylineId": 89, "halflife": 35}, {"title": "If there is no struggle, there is no progress.", "body": "But this approach, combined with the preceding four, will turn up a good number of unthinkable ideas.WhySome would ask, why would one want to do this?", "latitude": "53.55024", "longitude": "-122.09441", "userId": 138, "storylineId": 14, "halflife": 54}, {"title": "Life is change. Growth is optional. Choose wisely.", "body": "So a plan that promises freedom at the expense of knowing what to do with it may not be as good as it seems.Whichever route you take, expect a struggle.", "latitude": "-11.49917", "longitude": "111.859", "userId": 317, "storylineId": 25, "halflife": 14}, {"title": "Where there is great love, there are always miracles.", "body": "Now, thanks to technology, the rich live more like the average person.Cars are a good example of why.", "latitude": "41.32612", "longitude": "7.75583", "userId": 155, "storylineId": 63, "halflife": 70}, {"title": "The winds and waves are always on the side of the ablest navigators.", "body": "They know they'll feel bad if they don't work, and they have enough discipline to get themselves to their desks to start working.", "latitude": "50.21126", "longitude": "8.56633", "userId": 396, "storylineId": 35, "halflife": 81}, {"title": "You won't skid if you stay in a rut.", "body": "If you could find people who'd eliminated all such influences on their judgement, you'd probably still see variation in what they liked.", "latitude": "50.4", "longitude": "-6.91434", "userId": 51, "storylineId": 41, "halflife": 63}, {"title": "Doing nothing is better than being busy doing nothing.", "body": "Programmers tend to sort themselves into tribes according to the type of work they do and the tools they use, and some tribes are  smarter than others.", "latitude": "6.44417", "longitude": "-62.41667", "userId": 189, "storylineId": 37, "halflife": 61}, {"title": "Change your thoughts, change your life!", "body": "But if it's inborn it should be universal, and there are plenty of societies where parents don't mind if their teenage kids have sex?indeed, where it's normal for 14 year olds to become mothers.", "latitude": "56.34984", "longitude": "145.09519", "userId": 331, "storylineId": 35, "halflife": 49}, {"title": "The greatest obstacle to connecting with our joy is resentment.", "body": "Like good athletes, they don't work hard because the coach yells at them, but because they want to win.We have less power than bosses, and yet the founders work harder   than employees.", "latitude": "16.01402", "longitude": "-1.27682", "userId": 51, "storylineId": 80, "halflife": 34}, {"title": "A rolling stone gathers no moss.", "body": "[1]In the past, a startup would usually become profitable only after raising and spending quite a lot of money.", "latitude": "-7.85389", "longitude": "22.05258", "userId": 304, "storylineId": 39, "halflife": 2}, {"title": "Beware of the half truth. You may have gotten hold of the wrong half.", "body": "A probability can of course be mistaken, but there is little ambiguity about what it means, or how evidence should be combined to calculate it.", "latitude": "53.5125", "longitude": "-0.78333", "userId": 409, "storylineId": 27, "halflife": 31}, {"title": "A beautiful thing is never perfect.", "body": "If this were really a meaningless question, you might as well flip a coin.)Aiming for succinctness seems a good way to find new ideas.", "latitude": "50.69111", "longitude": "8.5457", "userId": 85, "storylineId": 79, "halflife": 99}, {"title": "Those who are free of resentful thoughts surely find peace.", "body": "Starting in January 2000, Yahoo's stock price began to crash, ultimately losing 95% of its value.Notice, though, that even with all the fat trimmed off its market cap, Yahoo was still worth a lot.", "latitude": "47.66033", "longitude": "-3.04563", "userId": 44, "storylineId": 55, "halflife": 35}, {"title": "Trouble is only opportunity in work clothes.", "body": "Another thing I learned from this experiment is that if you're going to distinguish between people, you better be sure you do it right.", "latitude": "37.15619", "longitude": "58.59333", "userId": 497, "storylineId": 15, "halflife": 67}, {"title": "When anger use your energy to do something productive.", "body": "Some clever person with a spell checker reduced one section to Zen-like incomprehensibility:    Also, common spelling errors will tend to get fixed.", "latitude": "47.66853", "longitude": "-70.73198", "userId": 12, "storylineId": 83, "halflife": 37}, {"title": "Most folks are about as happy as they make up their minds to be.", "body": "Nearly all wanted advice about dealing with future investors: how   much money should they take and what kind of terms should they expect?However,", "latitude": "41.74853", "longitude": "-105.51922", "userId": 353, "storylineId": 74, "halflife": 73}, {"title": "You can do it if you believe you can!", "body": "Gmail showed they could do more than search.Gmail also showed how much you could do with web-based software, if you took advantage of what later came to be called \"Ajax.\"", "latitude": "39.071", "longitude": "6.52468", "userId": 100, "storylineId": 86, "halflife": 45}, {"title": "Open minds lead to open doors.", "body": "When, if ever,  is a language too succinct for  its own good?The hypothesis I began with was that, except in pathological examples, I thought succinctness could be considered identical with power.", "latitude": "52.45784", "longitude": "71.99276", "userId": 486, "storylineId": 33, "halflife": 74}, {"title": "Important principles may, and must, be inflexible.", "body": "(It is just as well, anyway, if a backup system doesn't rely on the same technology as the primary system.)Another thing I may try in the future is to focus extra attention on specific parts of the email.", "latitude": "41.99217", "longitude": "15.33552", "userId": 186, "storylineId": 90, "halflife": 21}, {"title": "Self-complacency is fatal to progress.", "body": "(By the time King's plagiarism emerged, I'd lost the ability to be surprised by the misdeeds of famous people.)I doubt you could teach kids recent history without teaching them lies, because practically everyone who has anything to say about it has some kind of spin to put on it.", "latitude": "42.42269", "longitude": "-6.10998", "userId": 57, "storylineId": 58, "halflife": 90}, {"title": "Be as you wish to seem.", "body": "Instead of trying to make credentials harder to hack, we can also make them matter less.Let's think about what credentials are for.", "latitude": "51.63333", "longitude": "7.56612", "userId": 104, "storylineId": 60, "halflife": 86}, {"title": "Real success is finding your lifework in the work that you love.", "body": "By which I mean not that it has to make something physical, but that it has to have one thing it sells to many people, rather than doing custom work for individual clients.", "latitude": "29.37352", "longitude": "-93.92163", "userId": 297, "storylineId": 65, "halflife": 65}, {"title": "To fly, we have to have resistance.", "body": "The weather is terrible,  particularly in winter, and there's no interesting old city to make up for it, as there is in Boston.", "latitude": "-21.36", "longitude": "10.66046", "userId": 488, "storylineId": 70, "halflife": 100}, {"title": "Chaos and Order are not enemies, only opposites.", "body": "When a startup reaches the point where VCs have enough information to invest in it, the acquirer should have enough information to buy it.", "latitude": "49.95", "longitude": "81.52322", "userId": 454, "storylineId": 51, "halflife": 49}, {"title": "A man sees in the world what he carries in his heart.", "body": "These can be much more effective, not only in avoiding false positives, but in filtering too: for example, finding the recipient's email address base-64 encoded anywhere in a message is a very good spam indicator.But the real advantage of individual filters is that they'll all be different.", "latitude": "12.96199", "longitude": "7.35998", "userId": 444, "storylineId": 99, "halflife": 34}, {"title": "Chaos and Order are not enemies, only opposites.", "body": "The reason is that between your ability to delude yourself and the wildly unstable nature of the system you're dealing with, things probably either already are or could easily become much worse than they seem.What", "latitude": "46.03838", "longitude": "25.86667", "userId": 446, "storylineId": 93, "halflife": 17}, {"title": "The winds and waves are always on the side of the ablest navigators.", "body": "But if you don't know what you want to work on, or don't like to take orders, you may want to take the two-job route, if you can stand the risk.Don't decide too soon.", "latitude": "30.45046", "longitude": "-76.63691", "userId": 402, "storylineId": 82, "halflife": 5}, {"title": "Better be ignorant of a matter than half know it.", "body": "San Jose calls itself the capital of Silicon Valley, but when people in the Valley use the phrase \"the city,\" they mean San Francisco.", "latitude": "49.50274", "longitude": "-2.46056", "userId": 421, "storylineId": 30, "halflife": 45}, {"title": "Write your plans in pencil and give God the eraser.", "body": "And so although we were constantly hoping that one day (\"in a couple months\") everything would be stable enough that we could hire someone whose job was just to worry about the servers, it never happened.I don't think it could be any other way, as long as you're still actively developing the product.", "latitude": "43.52876", "longitude": "7.4", "userId": 239, "storylineId": 77, "halflife": 24}, {"title": "The world is always in movement.", "body": "But it probably wouldn't start to work properly till about age 22, because most people haven't had a big enough sample to pick friends from before then.SirensWhat you should not do, I think, is worry about the opinion of anyone beyond your friends.", "latitude": "30.51895", "longitude": "-88.33038", "userId": 83, "storylineId": 73, "halflife": 24}, {"title": "For everything that lives is holy, life delights in life.", "body": "But you have to overcome this:      Doing something \"simple\" at first glance does not mean you     aren't doing something meaningful, defensible, or valuable.", "latitude": "33.28439", "longitude": "-100.58944", "userId": 164, "storylineId": 86, "halflife": 47}, {"title": "Smile, breathe, and go slowly.", "body": "Parents know they've concealed the facts about sex, and many at some point sit their kids down and explain more.", "latitude": "51.72575", "longitude": "2.09472", "userId": 378, "storylineId": 22, "halflife": 87}, {"title": "An obstacle may be either a stepping stone or a stumbling block.", "body": "They lived in houses full of servants, wore elaborately uncomfortable clothes, and travelled about in carriages drawn by teams of horses which themselves required their own houses and servants.", "latitude": "14.88333", "longitude": "5.47087", "userId": 106, "storylineId": 68, "halflife": 78}, {"title": "Life is the flower for which love is the honey.", "body": "The founders will run engineering directly, and the rest of the company through the COO.The Open CageWith both employers and investors, the balance of power is slowly shifting towards the young.", "latitude": "45.78397", "longitude": "7.23333", "userId": 364, "storylineId": 26, "halflife": 17}, {"title": "What we achieve inwardly will change outer reality.", "body": "Not always, but usually there's a bigger offer coming, or perhaps even an IPO.Of course, the reason startups do better when they turn down acquisition offers is not necessarily that all such offers undervalue startups.", "latitude": "17.67261", "longitude": "6.63857", "userId": 117, "storylineId": 19, "halflife": 66}, {"title": "When performance exceeds ambition, the overlap is called success.", "body": "But the way the story appeared in the press sounded a lot more definite.Reporters like definitive statements.", "latitude": "53.95815", "longitude": "113.39056", "userId": 123, "storylineId": 89, "halflife": 30}, {"title": "Goals are the fuel in the furnace of achievement.", "body": "That will generally work unless you get trapped on a local maximum, like 1980s-style AI, or C.UpwindSo far, we've reduced the problem from thinking of a million dollar idea to thinking of a mistaken question.", "latitude": "23.90782", "longitude": "100.44229", "userId": 389, "storylineId": 57, "halflife": 16}, {"title": "Trust yourself. You know more than you think you do.", "body": "How many would have understood that this particular 19 year old was Bill Gates?It's hard to judge the young because (a) they change rapidly, (b) there is great variation between them, and (c) they're individually inconsistent.", "latitude": "51.55035", "longitude": "-2.45076", "userId": 490, "storylineId": 34, "halflife": 35}, {"title": "A goal without a plan is just a wish.", "body": "It's the partners who decide, and they view things with a colder eye.Because VCs invest large amounts, the money comes with more restrictions.", "latitude": "50.35", "longitude": "50.85939", "userId": 66, "storylineId": 34, "halflife": 18}, {"title": "It's not what happens to you, but how you react to it that matters.", "body": "People reply to dumb jokes with dumb jokes.Maybe the solution is to add a delay before people can respond to a comment, and make the length of the delay inversely proportional to some prediction of its quality.", "latitude": "49.40768", "longitude": "107.7185", "userId": 236, "storylineId": 5, "halflife": 31}, {"title": "If you cannot do great things, do small things in a great way.", "body": "It also means no one university will be good enough to act as a mecca, attracting talent from abroad and causing startups to form around it.The case of Germany is a strange one.", "latitude": "20.43538", "longitude": "145.23333", "userId": 113, "storylineId": 59, "halflife": 95}, {"title": "When you come to the end of your rope, tie a knot and hang on.", "body": "Another way to figure out what we're getting wrong is to look at what used to be acceptable and is now unthinkable.Changes between the past and the present sometimes do represent progress.", "latitude": "45.19912", "longitude": "109.30972", "userId": 451, "storylineId": 40, "halflife": 4}, {"title": "The greatest remedy for anger is delay.", "body": "It was so clearly a choice of doing good work xor being an insider that I was forced to see the distinction.", "latitude": "34.20931", "longitude": "9.48982", "userId": 43, "storylineId": 59, "halflife": 35}, {"title": "All know the way; few actually walk it.", "body": "If the pointy-haired boss had to think about the problem in its full complexity, it would make his brain explode.", "latitude": "51.27266", "longitude": "109.73839", "userId": 213, "storylineId": 72, "halflife": 81}, {"title": "It is impossible to feel grateful and depressed in the same moment.", "body": "If one person gets more, someone else has to get less.I can remember believing, as a child, that if a few rich people had all the money, it left less for everyone else.", "latitude": "40.49526", "longitude": "-73.81667", "userId": 279, "storylineId": 80, "halflife": 73}, {"title": "Life shrinks or expands in proportion to one's courage.", "body": "Their value is mainly as starting points: as questions for the people who had them to continue thinking about.What matters is not ideas, but the people who have them.", "latitude": "58.10887", "longitude": "120.26131", "userId": 196, "storylineId": 42, "halflife": 97}, {"title": "Life isn't about finding yourself. Life is about creating yourself.", "body": "If you're talking to one VC and he finds out that you were rejected by another several months ago, you'll definitely seem shopworn.So when do you approach VCs?", "latitude": "-12.5", "longitude": "-3.36685", "userId": 350, "storylineId": 62, "halflife": 56}, {"title": "You won't skid if you stay in a rut.", "body": "The Value of CommunityA surprising number of founders said what surprised them most about starting a startup was the value of community.", "latitude": "49.4992", "longitude": "-6.51236", "userId": 309, "storylineId": 97, "halflife": 16}, {"title": "Reason and free inquiry are the only effectual agents against error.", "body": "I'm increasingly convinced this type of thinking is not merely helpful in solving hard problems, but necessary.", "latitude": "30.65554", "longitude": "10.88333", "userId": 427, "storylineId": 64, "halflife": 70}, {"title": "A goal without a plan is just a wish.", "body": "Surely this is a lowly sort of thing to be interested in-- the sort of superficial quizzing best left to teenage girls.", "latitude": "48.23758", "longitude": "12.30276", "userId": 49, "storylineId": 58, "halflife": 50}, {"title": "The heart has eyes which the brain knows nothing of.", "body": "A far more likely theory, in his Ptolemaic model of the universe, is that a great artist is something that's good for you, like broccoli, because someone said so in a book.Saying that taste is just personal preference is a good way to prevent disputes.", "latitude": "45.45008", "longitude": "-89.82953", "userId": 9, "storylineId": 91, "halflife": 72}, {"title": "He who talks more is sooner exhausted.", "body": "I suspect almost every successful startup has.So one way to build great software is to start your own startup.", "latitude": "44.52341", "longitude": "7.56612", "userId": 296, "storylineId": 54, "halflife": 30}, {"title": "Why worry about tomorrow, when today is all we have?", "body": "If you find yourself saying a sentence that ends with \"but we're going to keep working on the startup,\" you are in big trouble.", "latitude": "48.05611", "longitude": "25.86667", "userId": 114, "storylineId": 39, "halflife": 19}, {"title": "I know but one freedom and that is the freedom of the mind.", "body": "In fact I suspect if you had the sixteen year old Shakespeare or Einstein in school with you, they'd seem impressive, but not totally unlike your other friends.Which is an uncomfortable thought.", "latitude": "50.20141", "longitude": "4.83194", "userId": 455, "storylineId": 55, "halflife": 91}, {"title": "Don't think of it as failure. Think of it as time-released success.", "body": "What's really happening is that startup-controlled rounds are taking the place of investor-controlled rounds.This is an instance of a very important meta-trend, one that Y Combinator itself has been based on from the beginning: founders are becoming increasingly powerful relative to investors.", "latitude": "26.48989", "longitude": "8.94439", "userId": 265, "storylineId": 80, "halflife": 63}, {"title": "Life shrinks or expands in proportion to one's courage.", "body": "You have to work actively to prevent your company growing into a \"weed tree,\" dependent on this source of easy but low-margin money.", "latitude": "39.69541", "longitude": "-3.18417", "userId": 184, "storylineId": 78, "halflife": 63}, {"title": "You always succeed in producing a result.", "body": "Many of the students who now major in English would major in writing if they could, and most would be better off.It will be argued that it is a good thing for students to be exposed to their literary heritage.", "latitude": "39.43316", "longitude": "119.08063", "userId": 84, "storylineId": 27, "halflife": 15}, {"title": "He who talks more is sooner exhausted.", "body": "It seemed that it was being used as a label for whatever happened to be new?that it didn't predict anything.But there is a common thread.", "latitude": "40.48643", "longitude": "58.10139", "userId": 270, "storylineId": 74, "halflife": 52}, {"title": "Each day provides its own gifts.", "body": "So even a small increase in the rate at which good ideas win would be a momentous change?big enough, probably, to justify a name like the \"new economy.\"Notes[1]", "latitude": "15.8466", "longitude": "20.1424", "userId": 5, "storylineId": 31, "halflife": 38}, {"title": "No act of kindness, no matter how small, is ever wasted.", "body": "If you're working on something so unusual that no one else is likely to think of it, you can take your time.", "latitude": "47.45781", "longitude": "7.14636", "userId": 417, "storylineId": 71, "halflife": 97}, {"title": "There are people who have money and people who are rich.", "body": "Others were surprised at the value of the startup community in the larger sense:      How advantageous it is to live in Silicon Valley, where you     can't help but hear all the cutting-edge tech and startup news,     and run into useful people constantly.", "latitude": "49.9", "longitude": "7.77008", "userId": 201, "storylineId": 10, "halflife": 13}, {"title": "The secret to a rich life is to have more beginnings than endings.", "body": "In principle you could avoid it, just as in principle you could avoid getting fat as you get old, but few do.", "latitude": "-6.19444", "longitude": "-85.48746", "userId": 44, "storylineId": 53, "halflife": 29}, {"title": "The foot feels the foot when it feels the ground.", "body": "This is what approaches like Brightmail's will degenerate into once spammers are pushed into using mad-lib techniques to generate everything else in the message.[13]", "latitude": "52.09375", "longitude": "6.45", "userId": 139, "storylineId": 62, "halflife": 5}, {"title": "Better than a thousand hollow words, is one word that brings peace.", "body": "The only kind of software you can build without studying users is the     sort for which you are the typical user.", "latitude": "50.22147", "longitude": "124.61972", "userId": 31, "storylineId": 18, "halflife": 46}, {"title": "Just as much as we see in others we have in ourselves.", "body": "But in practice it would not matter much where I put this threshold, because few probabilities end up in the middle of the range._ _ _One great advantage of the statistical approach is that you don't have to read so many spams.", "latitude": "42.58665", "longitude": "4.81514", "userId": 55, "storylineId": 99, "halflife": 67}, {"title": "Blaze with the fire that is never extinguished.", "body": "In theory these details are minor ones; by definition all the important points are supposed to be covered in the termsheet.Inexperience and wishful thinking combine to make founders feel that when they have a termsheet, they have a deal.", "latitude": "18.14806", "longitude": "5.70505", "userId": 187, "storylineId": 6, "halflife": 32}, {"title": "As we risk ourselves, we grow. Each new experience is a risk.", "body": "So are hackers, I think.If universities and research labs keep hackers from doing the kind of work they want to do, perhaps the place for them is in companies.", "latitude": "37.92448", "longitude": "0.35719", "userId": 68, "storylineId": 27, "halflife": 1}, {"title": "For success, attitude is equally as important as ability.", "body": "If an organization could immediately and cheaply measure the performance of recruits, they wouldn't need to examine their credentials.", "latitude": "19.52257", "longitude": "-3.22586", "userId": 131, "storylineId": 65, "halflife": 72}, {"title": "Love is just a word until someone comes along and gives it meaning.", "body": "The alarming thing about Web-based software is that there is nothing to prevent this becoming the default.", "latitude": "51.27266", "longitude": "19.87495", "userId": 300, "storylineId": 73, "halflife": 24}, {"title": "Tension is who you think you should be. Relaxation is who you are.", "body": "I've noticed for a while that the stuff I read on individual people's sites is as good as or better than the stuff I read in newspapers and magazines.", "latitude": "39.22883", "longitude": "-80.23184", "userId": 434, "storylineId": 29, "halflife": 79}, {"title": "If it is not right do not do it; if it is not true do not say it.", "body": "If you can recognize good startup founders by empathizing with them?if you both resonate at the same frequency?then you may already be a better startup picker than the median professional VC.", "latitude": "37.9712", "longitude": "18.60972", "userId": 178, "storylineId": 78, "halflife": 98}, {"title": "The eye sees only what the mind is prepared to comprehend.", "body": "You look at them and you think, all you have to do is get eight or ten lines in the right place and you've made this beautiful portrait.", "latitude": "32.1957", "longitude": "6.58333", "userId": 267, "storylineId": 6, "halflife": 76}, {"title": "The more you know yourself, the more you forgive yourself.", "body": "Books in most fields are written by people who know the subject from experience, but for startups there's a unique problem:  by definition the founders of successful startups don't need to write books to make money.", "latitude": "41.13967", "longitude": "0.18883", "userId": 359, "storylineId": 48, "halflife": 63}, {"title": "Bite off more than you can chew, then chew it.", "body": "Most of the people who read the source read it in illicit photocopies of John Lions' book, which though written in 1977 was not allowed to be published until 1996.Another example we can take from painting is the way that paintings are created by gradual refinement.", "latitude": "42.69592", "longitude": "8.92212", "userId": 346, "storylineId": 73, "halflife": 68}, {"title": "The years teach much which the days never know.", "body": "It's not considered insulting to say that ancient Greek mathematicians were naive in some respects, or at least lacked some concepts that would have made their lives easier.", "latitude": "26.13421", "longitude": "7.5934", "userId": 46, "storylineId": 52, "halflife": 3}, {"title": "Think for yourselves and let others enjoy the privilege to do so too.", "body": "Like the border between two warring states, the boundary between language and program is drawn and redrawn, until eventually it comes to rest along the mountains and rivers, the natural frontiers of your problem.", "latitude": "55.91528", "longitude": "15.91736", "userId": 301, "storylineId": 79, "halflife": 75}, {"title": "Keep true to the dreams of thy youth.", "body": "The more succinct the language, the shorter the program, and the    easier it is to load and keep in your head.You can magnify the effect of a powerful language by using a    style called bottom-up programming, where you write programs in    multiple layers, the lower ones acting as programming languages    for those above.", "latitude": "41.70507", "longitude": "-3.22586", "userId": 166, "storylineId": 29, "halflife": 58}, {"title": "Whoso loves, believes the impossible.", "body": "There is archaeological evidence for large settlements earlier, but it's hard to say what was happening in them.Hodges,", "latitude": "56.34984", "longitude": "11.13723", "userId": 368, "storylineId": 69, "halflife": 21}, {"title": "You can do what's reasonable or you can decide what's possible.", "body": "But as startup investors they'd have to compete against pros with a great deal more experience and motivation.Even corporations that have in-house VC groups generally forbid them to make their own investment decisions.", "latitude": "37.8257", "longitude": "38.73517", "userId": 381, "storylineId": 45, "halflife": 85}, {"title": "Our intention creates our reality.", "body": "I think you're seeing a country a full step ahead of Venezuela.The Lever of TechnologyWill technology increase the gap between rich and poor?", "latitude": "51.40029", "longitude": "7.64464", "userId": 479, "storylineId": 47, "halflife": 82}, {"title": "Our intention creates our reality.", "body": "You can do well in math and the natural sciences without having to learn empathy, and people in these fields tend to be smart, so the two qualities have come to be associated.", "latitude": "41.67777", "longitude": "124.92639", "userId": 498, "storylineId": 90, "halflife": 7}, {"title": "Peace comes from within. Do not seek it without.", "body": "The great fortunes of that time still derived more from what we would now call corruption than from commerce.", "latitude": "53.60164", "longitude": "-5.7974", "userId": 81, "storylineId": 90, "halflife": 97}, {"title": "Science is organized knowledge. Wisdom is organized life.", "body": "You don't simply get to do whatever you want; the board still has to act in the interest of the shareholders; but if you have a majority of board seats, then your opinion about what's in the interest of the shareholders will tend to prevail.So while board control is not total control, it's not imaginary either.", "latitude": "41.10652", "longitude": "18.61389", "userId": 376, "storylineId": 70, "halflife": 83}, {"title": "If a man does his best, what else is there?", "body": "All you need is strong convictions.Do religion and politics have something in common that explains this similarity?", "latitude": "36.09708", "longitude": "9.34294", "userId": 215, "storylineId": 80, "halflife": 58}, {"title": "Society develops wit, but its contemplation alone forms genius.", "body": "We'll have to worry not just about new things, but also about existing things becoming more addictive.", "latitude": "17.96833", "longitude": "3.39786", "userId": 246, "storylineId": 84, "halflife": 75}, {"title": "If you can't explain it simply, you don't understand it well enough.", "body": "[9]  With server-based software they are going to have to come up with  some other solution.Web-based software sells well, especially in comparison to desktop software, because it's easy to buy.", "latitude": "42.31893", "longitude": "122.27931", "userId": 369, "storylineId": 27, "halflife": 36}, {"title": "When performance exceeds ambition, the overlap is called success.", "body": "For example, explicit support for programs with multiple users, or data ownership at the level of type tags.Server-based applications also give us the answer to the question of what this new Lisp will be used to hack.", "latitude": "7.49167", "longitude": "77.70467", "userId": 216, "storylineId": 52, "halflife": 65}, {"title": "Every problem has a gift for you in its hands.", "body": "Instead of having both lists and strings, have just lists, with some way to give the compiler optimization advice that  will allow it to lay out strings as contiguous bytes if necessary.Since speed doesn't matter in most of a program, you won't ordinarily need to bother with this sort of micromanagement.", "latitude": "51.89333", "longitude": "6.45758", "userId": 208, "storylineId": 35, "halflife": 98}, {"title": "Goals are the fuel in the furnace of achievement.", "body": "I'm like someone who grew up poor, and can't bear to spend money even for something important, like going to the doctor.Some kinds of waste really are disgusting.", "latitude": "42.78064", "longitude": "8.83675", "userId": 67, "storylineId": 56, "halflife": 21}, {"title": "Nothing ever goes away until it has taught us what we need to know.", "body": "Now the misunderstood artist is a coffee-drinking vegan cartoonist whose work they see and say \"that's not art\" because it looks like stuff they've seen in the Sunday paper.[3]", "latitude": "51.38333", "longitude": "81.52322", "userId": 221, "storylineId": 59, "halflife": 34}, {"title": "Arriving at one point is the starting point to another.", "body": "The fund managers, who are called \"general partners,\" get about 2% of the fund annually as a management fee, plus about 20% of the fund's gains.There is a very sharp dropoff in performance among VC firms, because in the VC business both success and failure are self-perpetuating.", "latitude": "43.36995", "longitude": "-1.01304", "userId": 459, "storylineId": 25, "halflife": 52}]