[{"body": "She is vegan? Damn! No pizza then."}, {"body": "Do you want advice on how to sell your bike and videos?"}, {"body": "I need advice on how to become good friend with Katy Perry"}, {"body": "I want pizza, but I'm hikikomoring today. Can we have pizza party remotely?"}, {"body": "November 2012The way to get startup ideas is not to try to think of startup ideas.", "userId": 102, "postId": 15}, {"body": "I don't think it's a good idea to treat spam filtering as a straight text classification problem.", "userId": 436, "postId": 37}, {"body": "And one of the most conspicuous trends in the last batch was the large number of hardware startups.", "userId": 123, "postId": 34}, {"body": "[3] Imaginative people don't want to follow or lead.", "userId": 126, "postId": 90}, {"body": "Investors are rich enough to be rational and prefer the latter.", "userId": 122, "postId": 51}, {"body": "That was the point of creating it.", "userId": 401, "postId": 33}, {"body": "Dilution is normal.", "userId": 165, "postId": 53}, {"body": "They also generally provide a  better education.", "userId": 278, "postId": 98}, {"body": "You can get programmers who would never have come to you as employees by buying their  startups.", "userId": 36, "postId": 7}, {"body": "Artists aren't merely capable of shipping.", "userId": 235, "postId": 68}, {"body": "What drives you day to day is not wanting to look bad.You probably can't change that.", "userId": 231, "postId": 62}, {"body": "The recording industry hated the idea and resisted it as long as possible.", "userId": 144, "postId": 33}, {"body": "If I didn't know Lisp, reading this would set me asking questions.", "userId": 311, "postId": 19}, {"body": "He explained that he'd just bought it in Thailand.The", "userId": 173, "postId": 14}, {"body": "When you get to groups I know well, like hackers, I can say more precisely.", "userId": 169, "postId": 98}, {"body": "What are the great things to work on?", "userId": 259, "postId": 17}, {"body": "I can just begin to understand what it must have felt like for him.You only get one life.", "userId": 189, "postId": 28}, {"body": "Before us, seed funding came primarily from individual angel investors.", "userId": 476, "postId": 20}, {"body": "Because you get a lot of email, or because it's hard to get email out of your inbox?", "userId": 159, "postId": 45}, {"body": "Most investors, especially VCs, are not like founders.Some angels are, or were, hackers.", "userId": 198, "postId": 48}, {"body": "It works in everyday life, too.", "userId": 500, "postId": 14}, {"body": "And for many types of startup, that delay could be fatal.", "userId": 273, "postId": 47}, {"body": "But I have no idea if these guys are great hackers.", "userId": 150, "postId": 28}, {"body": "Want to try a frightening thought experiment?", "userId": 11, "postId": 94}, {"body": "And they are a classic example of the dangers of deciding what programmers are allowed to want.", "userId": 5, "postId": 68}, {"body": "But no more ambitious than it was for Apple to become as big as Apple, and they did it.", "userId": 58, "postId": 55}, {"body": "[6] Something similar happened when people first started trying to talk about abstractions.", "userId": 239, "postId": 58}, {"body": "So the best you can do is consider this force like a wind, and set up your boat accordingly.", "userId": 7, "postId": 100}, {"body": "And you don't have to wait to start.", "userId": 215, "postId": 31}, {"body": "I'd give Berkeley's Principles of Human Knowledge another shot in college.", "userId": 413, "postId": 17}, {"body": "What makes a good burrito?", "userId": 327, "postId": 81}, {"body": "In the startup world, most good ideas  seem bad initially.", "userId": 45, "postId": 48}, {"body": "Patrick Pantel and Dekang Lin.", "userId": 263, "postId": 41}, {"body": "Surely it meant nothing to get a good grade in such a class.In retrospect this was stupid.", "userId": 21, "postId": 78}, {"body": "If it becomes common to start a startup after college, students may start trying to maximize this.", "userId": 360, "postId": 41}, {"body": "The future is there.", "userId": 106, "postId": 36}, {"body": "But increasingly startups are evolving into a vehicle for developing technology on spec.As", "userId": 78, "postId": 32}, {"body": "Several times a week I set aside a chunk of time to meet founders we've funded.", "userId": 159, "postId": 100}, {"body": "You could have both now.", "userId": 472, "postId": 31}, {"body": "It's not just that the risk is decreased.", "userId": 356, "postId": 19}, {"body": "[16]One way to ensure you do a good job solving other people's problems is to make them your own.", "userId": 210, "postId": 61}, {"body": "I hadn't read the books we were assigned carefully enough.", "userId": 10, "postId": 97}, {"body": "The mystery comes mostly from looking for something that doesn't exist.", "userId": 323, "postId": 58}, {"body": "But spammers haven't yet made a serious effort to spoof statistical filters.", "userId": 64, "postId": 9}, {"body": "Paris is the only city I've lived in where people genuinely cared about art.", "userId": 178, "postId": 66}, {"body": "I think we may have made a mistake in thinking that hackers are turned off by Lisp's strangeness.", "userId": 251, "postId": 31}, {"body": "Wrong.", "userId": 85, "postId": 75}, {"body": "But it's easy to figure this out: just take a shower.", "userId": 37, "postId": 50}, {"body": "Why do founders ignore me?", "userId": 80, "postId": 45}, {"body": "The outer limit may be as low as 16.", "userId": 306, "postId": 95}, {"body": "And when we presented to investors, we presented to only 2, because that was all we knew.", "userId": 276, "postId": 82}, {"body": "That, I think, is going to be the real experiment this  summer.", "userId": 26, "postId": 78}, {"body": "That sounds cleverly skeptical, but I can prove it's mistaken.", "userId": 24, "postId": 93}, {"body": "I don't have the determination myself.", "userId": 166, "postId": 81}, {"body": "Where they fall relative to one another is a sensitive topic.", "userId": 374, "postId": 91}, {"body": "Microsoft, as I've said before, is a dangerously misleading example.", "userId": 74, "postId": 99}, {"body": "A few ideas from it turned out to be worth keeping; the bulk of it has had no effect at all.", "userId": 405, "postId": 47}, {"body": "And don't write the way they taught you to in school.The", "userId": 78, "postId": 59}, {"body": "These opportunities are not easy to find, though.", "userId": 174, "postId": 88}, {"body": "He made a general-purpose file classifier so good that it also worked for spam.One", "userId": 480, "postId": 89}, {"body": "(He wasn't, and he did.)", "userId": 153, "postId": 29}, {"body": "The survival rate for startups is way less than fifty percent.", "userId": 390, "postId": 82}, {"body": "wish someone would get this point across to the present administration.)I'm", "userId": 420, "postId": 27}, {"body": "Was this wrong?", "userId": 101, "postId": 19}, {"body": "Because the people whose job is to sell you stuff are really, really good at it.", "userId": 302, "postId": 36}, {"body": "They want to be on your board not just so that they can advise you, but so that they can watch you.", "userId": 131, "postId": 39}, {"body": "But Sam Altman is a very unusual guy.", "userId": 456, "postId": 25}, {"body": "More likely they'll want you to hold out for 100.", "userId": 346, "postId": 71}, {"body": "The conventional wisdom in the Lisp world is that the first problem is the real one.", "userId": 47, "postId": 82}, {"body": "Not recent ones; you wouldn't find those in our high school library.", "userId": 466, "postId": 66}, {"body": "There are also several you can't, notably ineptitude and bad luck.[2]", "userId": 181, "postId": 12}, {"body": "Samuel Johnson said \"no man but a blockhead ever wrote except for money.\"", "userId": 275, "postId": 37}, {"body": "Perhaps the most accurate way to put it would be to say that Watt reinvented the steam engine.[3]", "userId": 55, "postId": 77}, {"body": "At a minimum, files will be centrally available for users who want that.", "userId": 423, "postId": 42}, {"body": "Notes[1] A doctor friend warns that even this can give an inaccurate  picture.", "userId": 51, "postId": 14}, {"body": "They want statements with punch, like \"top ten.\"", "userId": 52, "postId": 8}, {"body": "Web-based software forces programmers to.", "userId": 294, "postId": 38}, {"body": "After that there's not much.", "userId": 80, "postId": 88}, {"body": "I'm not going to say you shouldn't listen to them.", "userId": 163, "postId": 47}, {"body": "Young startups are fragile.", "userId": 76, "postId": 15}, {"body": "But adults ask this mainly as a conversation starter.", "userId": 439, "postId": 71}, {"body": "Fortunately, I was 19 at the time and not too resistant to learning new things.", "userId": 175, "postId": 45}, {"body": "It's also the best route to    that holy grail, reusability.", "userId": 216, "postId": 23}, {"body": "Then I looked at his face and realized he didn't understand.", "userId": 361, "postId": 97}, {"body": "And once it spreads to hotels, where is the point (in size of chain) at which it stops?", "userId": 492, "postId": 54}, {"body": "More recently the recipe is often one founder, one VC, and one independent.", "userId": 224, "postId": 87}, {"body": "But I don't think this is what makes languages fast for users.", "userId": 52, "postId": 78}, {"body": "Look down at your hands.", "userId": 267, "postId": 87}, {"body": "Neither Apple nor Yahoo nor Google nor Facebook were even supposed to be companies at first.", "userId": 245, "postId": 93}, {"body": "Never make users register, unless you need to in order to store something for them.", "userId": 164, "postId": 94}, {"body": "But it's useful to consider these two ideas separately.[13]", "userId": 246, "postId": 96}, {"body": "So get to work.", "userId": 442, "postId": 74}, {"body": "Sun now pretends that Java is a grassroots, open-source language effort like Perl or Python.", "userId": 315, "postId": 100}, {"body": "And you know why?", "userId": 380, "postId": 5}, {"body": "Or you can become a de facto employee of the company.", "userId": 345, "postId": 98}, {"body": "There's nothing more than a slight stirring of discomfort.", "userId": 415, "postId": 31}, {"body": "I recently saw an ad for waiters saying they wanted people with a \"passion for service.\"", "userId": 136, "postId": 98}, {"body": "It's like the rule that in buying a house you should consider location first of all.", "userId": 477, "postId": 13}, {"body": "Their reputation with programmers used to be great.", "userId": 272, "postId": 25}, {"body": "Big problems are terrifying.", "userId": 408, "postId": 77}, {"body": "people by their academic credentials was in its time an advance.", "userId": 449, "postId": 26}]